[
  {
    "subreddit": "germany",
    "post_id": "ubio8u",
    "title": "Please read before posting!",
    "author": "thewindinthewillows",
    "score": 640,
    "upvote_ratio": 0.98,
    "num_comments": 5117,
    "created_utc": 1650885197.0,
    "created_datetime": "2022-04-25T13:13:17",
    "url": "https://www.reddit.com/r/germany/comments/ubio8u/please_read_before_posting/",
    "permalink": "https://reddit.com/r/germany/comments/ubio8u/please_read_before_posting/",
    "selftext": "Welcome to /r/germany, the **English-language subreddit about the country of Germany**.\n\n**Please read this entire post and follow the links, if applicable.**\n\nWe have prepared **[FAQs](https://www.reddit.com/r/germany/wiki/faq)** and an extensive  **[Wiki](https://www.reddit.com/r/germany/wiki/index)**. Please use these resources. If you post questions that are easily answered, our regulars will point you to those resources anyway. Additionally, please use the **Reddit search**. [Edit: Don't claim you read the Wiki and it does not contain anything about your question when it's clear that you didn't read it. We know what's in the Wiki, and we will continue to point you there.]\n\nThis goes particularly if you are asking about **studying in Germany**. There are multiple Wiki articles covering a lot of information. And yes, that means reading and doing your own research. It's good practice for what a German university will expect you to do.\n\n**Short questions** can be asked in the comments to this post. Please either leave a comment here or make a new post, not both.\n\n**If you ask questions in the subreddit, please provide enough information for people to be able to actually help you.** \"Can I find a job in Germany?\" will not give you useful answers. \"I have [qualification], [years of experience], [language skills], want to work as [job description], and am a citizen of [country]\" will. If people ask for more information, they're not being mean, but rather trying to find out what you actually need to know.\n\n----------------\n\n**German-language content** can go to **/r/de** or **/r/FragReddit**.\n\nQuestions **about the German language** are better suited to **/r/German**.\n\n**Covid-related content** should go into **[this post](https://www.reddit.com/r/germany/comments/r7ui9b/megathread_corona_rules_vaccination_questions_etc/)** until further notice.\n\n**/r/LegaladviceGerman/** has limited **legal advice** - but make sure to read their disclaimers.",
    "is_self": true,
    "link_flair_text": null,
    "comments": [
      {
        "comment_id": "i647iar",
        "author": "Grimthak",
        "body": "Nice, a new pinned post.\n\nNow I would send the usual \"How to study in germany\" to this thread. \n\nYou should add a link to r/legaladvicegerman. Some questions are better ask there then here.",
        "score": 15,
        "created_utc": 1650885556.0,
        "created_datetime": "2022-04-25T13:19:16",
        "parent_id": "t3_ubio8u",
        "is_submitter": false
      },
      {
        "comment_id": "mdyczo1",
        "author": "Grimthak",
        "body": "Ist this sub broken? There are no new posts since yesterday.",
        "score": 10,
        "created_utc": 1740124175.0,
        "created_datetime": "2025-02-21T08:49:35",
        "parent_id": "t3_ubio8u",
        "is_submitter": false
      },
      {
        "comment_id": "inyu4mc",
        "author": "bledi31",
        "body": "Got an update for reddit on android today. Wiki seems to be working on the app now.",
        "score": 6,
        "created_utc": 1662888815.0,
        "created_datetime": "2022-09-11T11:33:35",
        "parent_id": "t3_ubio8u",
        "is_submitter": false
      },
      {
        "comment_id": "koedz6b",
        "author": "__what_the_fuck__",
        "body": "@Mods maybe it's time to archive this thread and open an new one?",
        "score": 6,
        "created_utc": 1706766777.0,
        "created_datetime": "2024-02-01T06:52:57",
        "parent_id": "t3_ubio8u",
        "is_submitter": false
      },
      {
        "comment_id": "kfrhqhk",
        "author": "Rhoderick",
        "body": "Happy new year, folks.",
        "score": 5,
        "created_utc": 1704064172.0,
        "created_datetime": "2024-01-01T00:09:32",
        "parent_id": "t3_ubio8u",
        "is_submitter": false
      }
    ],
    "keyword_analysis": {
      "found_keywords": {
        "claim": "insurance"
      },
      "found_categories": [
        "insurance"
      ],
      "has_relevant_keywords": true,
      "keyword_count": 1
    },
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post is a pinned welcome message for the /r/germany subreddit.  It directs users to FAQs and a wiki for information about Germany. While a commen",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 2
  },
  {
    "subreddit": "germany",
    "post_id": "1nbkej3",
    "title": "I lived in Germany for 6 years, did everything 'right', but now I'm stuck and extremely disappointed.",
    "author": "Emotion-Adorable",
    "score": 535,
    "upvote_ratio": 0.87,
    "num_comments": 215,
    "created_utc": 1757328436.0,
    "created_datetime": "2025-09-08T12:47:16",
    "url": "https://www.reddit.com/r/germany/comments/1nbkej3/i_lived_in_germany_for_6_years_did_everything/",
    "permalink": "https://reddit.com/r/germany/comments/1nbkej3/i_lived_in_germany_for_6_years_did_everything/",
    "selftext": "\\*\\*\\*I posted this a few days ago, but was then deleted due to community's rule violation (my fault, my first proper Reddit post). Only today I have the time to redo and post it again.\n\nJust want to vent, because currently it feels like life is punching me in the face repeatedly, despite all my effort. \n\nI'm from a South East Asian country, came to Germany 6 years ago, and went the usual path for a foreigner student: studienkolleg, bachelor, master, and then hopefully getting a white collar job. I always aware that I'm in disadvantage to others because I'm an immigrant, so since day 1 I knew I had to give my best.\n\nI finished bachelor and my master (electrical engineering- but leaning more on software development side) both in German and in standard study time with 1.x final score (about to submit master thesis). From 4. semester in bachelor, I started working as working student and intern, and then did my bachelor thesis in a top tier supplier in the industry as software developer. During master, I worked part time in another international company, also as developer. Currently, I'm writing thesis in that company too and will submit it in a few weeks. \n\nFor the last 6 years, I tried my best to prepare myself for working life. I studied well, like and understand what I learned. Many Profs like me for being the textbook \"good\" and hardworking student. I also know I need to have practical experience, so as soon as I felt ready, I started working in related field. In both companies, colleagues liked me, I finished the tasks well and on time. \n\nI passed Goethe German B2 back home, and by finishing the Studienkolleg and Bachelor in German, I'm officially qualified as C1. All of my job interviews were in German. The main language struggle I have is with daily German language, which is much different from the Hochdeutsch I'm so used to. So I try my best to improve German by self learning, always use German even English is also an option, such as at work or joining sport clubs full of German.\n\nI thought if I try my best to prepare myself, at the end of the day I would at the end of the day be rewarded.\n\nNow, to the punching part:\n\nEarlier this year, while writing my thesis, my boss mentioned a full time open position in my team and if I'm interested after my thesis. Hell yes. I even have talked to an upper manager as part of the process (internal recruiting, so chance was really high, they tried to fill the position for over a year by then). Everything seemed on track.\n\nBoom, by June, due to the shitty economy situation, management stops hiring for that position and wait till next year. Suddenly, now I have to scramble to apply for a job while writing my thesis. That stings. \n\nAfter 2 months, over 70 applications, HR interviews with 2 companies, leading to 1 last technical round, which went really well, with last 5 candidates left, then simply rejected. I politely asked the interviewer for reasons why I'm rejected and feedback and got ghosted. Feel like after all I did the last 6 years, I'm not good enough, so I'm extremely demotivated.  \nAfter a week of encouraging myself, that maybe it's not all bad. After thesis, I'm still allowed to be a student for a semester (stated in the rules of my uni), so I can go back as working student at my company, working parttime, still can finance myself while having time doing side projects, improving my skills. I mentioned to my manager a few weeks ago, he said great (he had tried for a while to help me somehow stay in the company till the other position is opened again) and will talk to HR about that. \n\nA few days ago he told me that, according to HR, despite still registered as student at my uni, due to some holy Germany laws, as soon as I finished all classes and submit my thesis, I'm not allowed to work as Werkstudent anymore, therefore they or any other companies can't hire me. :D\n\nI now cant find student job at any other company (no one hires ones with only 1 semester left) and will have no income after this month, so my only choice is to find a fulltime job. I know it has only been a few months and my case is still not the end of the world, but its just that after several years of truly maximal efforts, things just don't work out because of factors that I have so little control of. And the fact that it comes subsequently in a short amount of time feels like being punched repeatedly in the face....\n\nSome further background info:\n\nI am not EU citizen, have a student visa, so Bürgergeld and BAföG or anything similar are not an option for me. I am still enrolled to my uni until April, so visa is fortunately still not a problem (yet). I have a small savings, enough for a few months, but if the job search takes too long, then part time job is a must then.\n\nI really don't want to sound cocky, but based on reviews of fellow students, profs and my white collar friends, my resume is really good. For my second student job, I received 3 job offers after 10 days of applying (God bless the job market back then, too). But of course, I will still try improving my CV as well, based on some suggestions from the last post.\n\nTL;DR: 6 years as immigrant in Germany, did bachelor’s and master’s (standard study period, good grades, lots of working student, integrated into German culture). Thought I’d set myself up for a smooth start into working life. Full-time job offer disappeared because of hiring freeze, student job option blocked by law, now stuck applying in a bad economy with only rejections. Feeling exhausted and demotivated.\n\n\nEDIT:\nWow, thanks everyone for your kind words and for further helps. Reading your comments and stories makes me feel Im not alone in this. Hope we would all soon overcome this terrible period. \nBtw, because some have mentioned: I studied Electrical Engineering but lean more onto the software development side, proficient in C++, Python and looking for a IT job in cities around Frankfurt am Main (sadly moving is not an option for me due because I just moved recently). If someone knows about a matching position somewhere, I would love to learn more about it and we could discuss more in DM. Thanksss everyone",
    "is_self": true,
    "link_flair_text": null,
    "comments": [
      {
        "comment_id": "nd2bh5x",
        "author": "Jodelbert",
        "body": "Master Geoscientist here. Started studying when there was a big mining boom in the 2000s, thought I'd go to Australia and work for a big mining company or something or rather. Then the whole sector kind of receded and I felt betrayed, somewhat at least. \n\nFinished my master thesis with a 1.x as well. Wrote more than 200 applications. Had to work at Decathlon after finishing uni for half a year and then found a job in a field that is 0% related to my studies lol.\n\nI'm German, born and raised here.\n\nI'm sorry you feel this way because it absolutely sucks, but it happens to natives as well. Keep on fighting, there will be better times ahead.",
        "score": 506,
        "created_utc": 1757329175.0,
        "created_datetime": "2025-09-08T12:59:35",
        "parent_id": "t3_1nbkej3",
        "is_submitter": false
      },
      {
        "comment_id": "nd2al4y",
        "author": "george_gamow",
        "body": "Unfortunately this has nothing to do with you. A lot of companies aren't even hiring, posting fake job ads to appear like they're growing or just to gather CVs, more experienced people are unemployed than usual so the competition is hard for everyone",
        "score": 542,
        "created_utc": 1757328736.0,
        "created_datetime": "2025-09-08T12:52:16",
        "parent_id": "t3_1nbkej3",
        "is_submitter": false
      },
      {
        "comment_id": "nd2b0nd",
        "author": "Thraxas89",
        "body": "Yeah beside the student Job thing (which has good reasons, though they don’t apply here) the whole world is going through a downturn currently and its neither about your Status not even Germany. Its just bad luck.",
        "score": 130,
        "created_utc": 1757328951.0,
        "created_datetime": "2025-09-08T12:55:51",
        "parent_id": "t3_1nbkej3",
        "is_submitter": false
      },
      {
        "comment_id": "nd2dbd4",
        "author": "EngineerNumerous4053",
        "body": "You are allowed to delay your Thesis submission usually. Try discussing with your Thesis supervisor to delay the submission deadline. This will give you longer time to stay employed at your current company. \n\nAlso, you still retain your student status until your colloquium! And your colloquium can be several months after your Thesis submission (mine was 15months after submitting my thesis:') ) \nYour professor can choose to help here! Basically, as soon as the Thesis is corrected, you need to get a colloquium date, but the thesis correction can be delayed. \n\nThese two measures should give you more time as a student, and as a working student. You can use that time to hopefully either get the FT job at your existing company, or luck out with a new place. \n\nEither way, don't give up now! You have gotten quite far and regardless of how this all works, you can still get a job seeker visa, and find other part time gigs to support yourself until you get a full time job.\nGood luck!",
        "score": 72,
        "created_utc": 1757330053.0,
        "created_datetime": "2025-09-08T13:14:13",
        "parent_id": "t3_1nbkej3",
        "is_submitter": false
      },
      {
        "comment_id": "nd2hy8e",
        "author": "dodiyeztr",
        "body": "Just as a side note you will be ghosted after asking for a feedback because they don't want to give a written feedback that might incriminate themselves in a court of law. Try to ask for a 15 mins video call session, you will likely get a response.",
        "score": 30,
        "created_utc": 1757332133.0,
        "created_datetime": "2025-09-08T13:48:53",
        "parent_id": "t3_1nbkej3",
        "is_submitter": false
      }
    ],
    "keyword_analysis": {
      "found_keywords": {
        "application": "visa",
        "rejection": "visa",
        "interview": "visa"
      },
      "found_categories": [
        "visa"
      ],
      "has_relevant_keywords": true,
      "keyword_count": 3
    },
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"While the post mentions the author's experience as a foreign student in Germany, including going through 'studienkolleg, bachelor, master', and implicitly s",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 2
  },
  {
    "subreddit": "germany",
    "post_id": "1nbkej3",
    "title": "I lived in Germany for 6 years, did everything 'right', but now I'm stuck and extremely disappointed.",
    "author": "Emotion-Adorable",
    "score": 531,
    "upvote_ratio": 0.87,
    "num_comments": 215,
    "created_utc": 1757328436.0,
    "created_datetime": "2025-09-08T12:47:16",
    "url": "https://www.reddit.com/r/germany/comments/1nbkej3/i_lived_in_germany_for_6_years_did_everything/",
    "permalink": "https://reddit.com/r/germany/comments/1nbkej3/i_lived_in_germany_for_6_years_did_everything/",
    "selftext": "\\*\\*\\*I posted this a few days ago, but was then deleted due to community's rule violation (my fault, my first proper Reddit post). Only today I have the time to redo and post it again.\n\nJust want to vent, because currently it feels like life is punching me in the face repeatedly, despite all my effort. \n\nI'm from a South East Asian country, came to Germany 6 years ago, and went the usual path for a foreigner student: studienkolleg, bachelor, master, and then hopefully getting a white collar job. I always aware that I'm in disadvantage to others because I'm an immigrant, so since day 1 I knew I had to give my best.\n\nI finished bachelor and my master (electrical engineering- but leaning more on software development side) both in German and in standard study time with 1.x final score (about to submit master thesis). From 4. semester in bachelor, I started working as working student and intern, and then did my bachelor thesis in a top tier supplier in the industry as software developer. During master, I worked part time in another international company, also as developer. Currently, I'm writing thesis in that company too and will submit it in a few weeks. \n\nFor the last 6 years, I tried my best to prepare myself for working life. I studied well, like and understand what I learned. Many Profs like me for being the textbook \"good\" and hardworking student. I also know I need to have practical experience, so as soon as I felt ready, I started working in related field. In both companies, colleagues liked me, I finished the tasks well and on time. \n\nI passed Goethe German B2 back home, and by finishing the Studienkolleg and Bachelor in German, I'm officially qualified as C1. All of my job interviews were in German. The main language struggle I have is with daily German language, which is much different from the Hochdeutsch I'm so used to. So I try my best to improve German by self learning, always use German even English is also an option, such as at work or joining sport clubs full of German.\n\nI thought if I try my best to prepare myself, at the end of the day I would at the end of the day be rewarded.\n\nNow, to the punching part:\n\nEarlier this year, while writing my thesis, my boss mentioned a full time open position in my team and if I'm interested after my thesis. Hell yes. I even have talked to an upper manager as part of the process (internal recruiting, so chance was really high, they tried to fill the position for over a year by then). Everything seemed on track.\n\nBoom, by June, due to the shitty economy situation, management stops hiring for that position and wait till next year. Suddenly, now I have to scramble to apply for a job while writing my thesis. That stings. \n\nAfter 2 months, over 70 applications, HR interviews with 2 companies, leading to 1 last technical round, which went really well, with last 5 candidates left, then simply rejected. I politely asked the interviewer for reasons why I'm rejected and feedback and got ghosted. Feel like after all I did the last 6 years, I'm not good enough, so I'm extremely demotivated.  \nAfter a week of encouraging myself, that maybe it's not all bad. After thesis, I'm still allowed to be a student for a semester (stated in the rules of my uni), so I can go back as working student at my company, working parttime, still can finance myself while having time doing side projects, improving my skills. I mentioned to my manager a few weeks ago, he said great (he had tried for a while to help me somehow stay in the company till the other position is opened again) and will talk to HR about that. \n\nA few days ago he told me that, according to HR, despite still registered as student at my uni, due to some holy Germany laws, as soon as I finished all classes and submit my thesis, I'm not allowed to work as Werkstudent anymore, therefore they or any other companies can't hire me. :D\n\nI now cant find student job at any other company (no one hires ones with only 1 semester left) and will have no income after this month, so my only choice is to find a fulltime job. I know it has only been a few months and my case is still not the end of the world, but its just that after several years of truly maximal efforts, things just don't work out because of factors that I have so little control of. And the fact that it comes subsequently in a short amount of time feels like being punched repeatedly in the face....\n\nSome further background info:\n\nI am not EU citizen, have a student visa, so Bürgergeld and BAföG or anything similar are not an option for me. I am still enrolled to my uni until April, so visa is fortunately still not a problem (yet). I have a small savings, enough for a few months, but if the job search takes too long, then part time job is a must then.\n\nI really don't want to sound cocky, but based on reviews of fellow students, profs and my white collar friends, my resume is really good. For my second student job, I received 3 job offers after 10 days of applying (God bless the job market back then, too). But of course, I will still try improving my CV as well, based on some suggestions from the last post.\n\nTL;DR: 6 years as immigrant in Germany, did bachelor’s and master’s (standard study period, good grades, lots of working student, integrated into German culture). Thought I’d set myself up for a smooth start into working life. Full-time job offer disappeared because of hiring freeze, student job option blocked by law, now stuck applying in a bad economy with only rejections. Feeling exhausted and demotivated.\n\n\nEDIT:\nWow, thanks everyone for your kind words and for further helps. Reading your comments and stories makes me feel Im not alone in this. Hope we would all soon overcome this terrible period. \nBtw, because some have mentioned: I studied Electrical Engineering but lean more onto the software development side, proficient in C++, Python and looking for a IT job in cities around Frankfurt am Main (sadly moving is not an option for me due because I just moved recently). If someone knows about a matching position somewhere, I would love to learn more about it and we could discuss more in DM. Thanksss everyone",
    "is_self": true,
    "link_flair_text": null,
    "comments": [
      {
        "comment_id": "nd2bh5x",
        "author": "Jodelbert",
        "body": "Master Geoscientist here. Started studying when there was a big mining boom in the 2000s, thought I'd go to Australia and work for a big mining company or something or rather. Then the whole sector kind of receded and I felt betrayed, somewhat at least. \n\nFinished my master thesis with a 1.x as well. Wrote more than 200 applications. Had to work at Decathlon after finishing uni for half a year and then found a job in a field that is 0% related to my studies lol.\n\nI'm German, born and raised here.\n\nI'm sorry you feel this way because it absolutely sucks, but it happens to natives as well. Keep on fighting, there will be better times ahead.",
        "score": 504,
        "created_utc": 1757329175.0,
        "created_datetime": "2025-09-08T12:59:35",
        "parent_id": "t3_1nbkej3",
        "is_submitter": false
      },
      {
        "comment_id": "nd2al4y",
        "author": "george_gamow",
        "body": "Unfortunately this has nothing to do with you. A lot of companies aren't even hiring, posting fake job ads to appear like they're growing or just to gather CVs, more experienced people are unemployed than usual so the competition is hard for everyone",
        "score": 537,
        "created_utc": 1757328736.0,
        "created_datetime": "2025-09-08T12:52:16",
        "parent_id": "t3_1nbkej3",
        "is_submitter": false
      },
      {
        "comment_id": "nd2b0nd",
        "author": "Thraxas89",
        "body": "Yeah beside the student Job thing (which has good reasons, though they don’t apply here) the whole world is going through a downturn currently and its neither about your Status not even Germany. Its just bad luck.",
        "score": 128,
        "created_utc": 1757328951.0,
        "created_datetime": "2025-09-08T12:55:51",
        "parent_id": "t3_1nbkej3",
        "is_submitter": false
      },
      {
        "comment_id": "nd2dbd4",
        "author": "EngineerNumerous4053",
        "body": "You are allowed to delay your Thesis submission usually. Try discussing with your Thesis supervisor to delay the submission deadline. This will give you longer time to stay employed at your current company. \n\nAlso, you still retain your student status until your colloquium! And your colloquium can be several months after your Thesis submission (mine was 15months after submitting my thesis:') ) \nYour professor can choose to help here! Basically, as soon as the Thesis is corrected, you need to get a colloquium date, but the thesis correction can be delayed. \n\nThese two measures should give you more time as a student, and as a working student. You can use that time to hopefully either get the FT job at your existing company, or luck out with a new place. \n\nEither way, don't give up now! You have gotten quite far and regardless of how this all works, you can still get a job seeker visa, and find other part time gigs to support yourself until you get a full time job.\nGood luck!",
        "score": 72,
        "created_utc": 1757330053.0,
        "created_datetime": "2025-09-08T13:14:13",
        "parent_id": "t3_1nbkej3",
        "is_submitter": false
      },
      {
        "comment_id": "nd2hy8e",
        "author": "dodiyeztr",
        "body": "Just as a side note you will be ghosted after asking for a feedback because they don't want to give a written feedback that might incriminate themselves in a court of law. Try to ask for a 15 mins video call session, you will likely get a response.",
        "score": 32,
        "created_utc": 1757332133.0,
        "created_datetime": "2025-09-08T13:48:53",
        "parent_id": "t3_1nbkej3",
        "is_submitter": false
      }
    ],
    "keyword_analysis": {
      "found_keywords": {
        "application": "visa",
        "rejection": "visa",
        "interview": "visa"
      },
      "found_categories": [
        "visa"
      ],
      "has_relevant_keywords": true,
      "keyword_count": 3
    },
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"While the post mentions the author's experience as a foreign student in Germany, including going through 'studienkolleg, bachelor, master',  the main focus ",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 2
  }
]