[
  {
    "subreddit": "IWantOut",
    "post_id": "t123a9",
    "title": "Megathread for Ukrainians Seeking Asylum",
    "author": "whiteraven4",
    "score": 1436,
    "upvote_ratio": 0.99,
    "num_comments": 217,
    "created_utc": 1645789518.0,
    "created_datetime": "2022-02-25T12:45:18",
    "url": "https://www.reddit.com/r/IWantOut/comments/t123a9/megathread_for_ukrainians_seeking_asylum/",
    "permalink": "https://reddit.com/r/IWantOut/comments/t123a9/megathread_for_ukrainians_seeking_asylum/",
    "selftext": "Need advise on how to claim asylum? Have some good resources to help others? Post them here.\n\nWe currently will still allow individual posts. However, if things get out of hand and too difficult to effectively moderate, we may only allow separate posts after individual consideration.\n\nPlease keep things civil and report any inappropriate comments. We cannot read every single comment and depend on the community to help keep things civil and on topic.",
    "is_self": true,
    "link_flair_text": null,
    "comments": [
      {
        "comment_id": "hydhdcq",
        "author": "[deleted]",
        "body": "Canada is accepting Ukrainian refugees as a priority. The government said that you can fly to Canada from Poland, Slovakia, Moldova, or Romania.\n\nThey have set an international phone number (+1 613-321-4243), more info here https://www.canada.ca/en/immigration-refugees-citizenship/news/2022/02/additional-immigration-support-for-those-affected-by-the-situation-in-ukraine.html\n\nWe have a large Ukrainian diaspora by the way, you are welcome here.",
        "score": 248,
        "created_utc": 1645793269.0,
        "created_datetime": "2022-02-25T13:47:49",
        "parent_id": "t3_t123a9",
        "is_submitter": false
      },
      {
        "comment_id": "hyddgkx",
        "author": "vardonir",
        "body": "The Polish government has a website for Ukrainians seeking asylum, in 4 languages: https://www.gov.pl/web/udsc/ukraina",
        "score": 114,
        "created_utc": 1645790915.0,
        "created_datetime": "2022-02-25T13:08:35",
        "parent_id": "t3_t123a9",
        "is_submitter": false
      },
      {
        "comment_id": "hydm14p",
        "author": "ruber_r",
        "body": "Czech republic is inviting Ukrainians, with or without passport. No deportations. You can overstay your visa-free 90 days. You can get legal status (refugee, student etc.). If you are in Czechia on regular visa and it should expire, you are entitled to prolongation. Ukrainian nationals who register as refugees are immediately able to work legally and are also part of public health insurance (free of charge). We have refugee centers in bigger cities that help people without local family/friends.\n\nRefugees from Ukraine can take their pets with them. Usual EU import regulations (microchip and rabies vaccine) have been suspended. You just have to vaccinate and microchip your dog or cat after arrival here. Most vets will treat your animals for free or at reduced cost.",
        "score": 91,
        "created_utc": 1645795793.0,
        "created_datetime": "2022-02-25T14:29:53",
        "parent_id": "t3_t123a9",
        "is_submitter": false
      },
      {
        "comment_id": "hydpqkn",
        "author": "[deleted]",
        "body": "[tips on how to survive from a Bosnia war survivor](https://www.reddit.com/r/ukraine/comments/t0dby0/tips_on_how_to_survive_a_war_zone_as_a_civilian/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
        "score": 76,
        "created_utc": 1645797609.0,
        "created_datetime": "2022-02-25T15:00:09",
        "parent_id": "t3_t123a9",
        "is_submitter": false
      },
      {
        "comment_id": "hydhahg",
        "author": "stateofyou",
        "body": "Romania is accepting Ukrainian citizens",
        "score": 48,
        "created_utc": 1645793223.0,
        "created_datetime": "2022-02-25T13:47:03",
        "parent_id": "t3_t123a9",
        "is_submitter": false
      }
    ],
    "keyword_analysis": {
      "found_keywords": {
        "overstay": "visa",
        "claim": "insurance"
      },
      "found_categories": [
        "visa",
        "insurance"
      ],
      "has_relevant_keywords": true,
      "keyword_count": 2
    },
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"While the post and comments mention keywords like 'overstay' and 'claim', the primary focus is on providing assistance and resources for Ukrainians seeking ",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 2
  },
  {
    "subreddit": "IWantOut",
    "post_id": "1gkv77m",
    "title": "MEGATHREAD: Emigrating after the US election results",
    "author": "spacemanaut",
    "score": 2043,
    "upvote_ratio": 0.89,
    "num_comments": 2005,
    "created_utc": 1730887752.0,
    "created_datetime": "2024-11-06T11:09:12",
    "url": "https://www.reddit.com/r/IWantOut/comments/1gkv77m/megathread_emigrating_after_the_us_election/",
    "permalink": "https://reddit.com/r/IWantOut/comments/1gkv77m/megathread_emigrating_after_the_us_election/",
    "selftext": "Every US election brings anxiety and uncertainty, and with that comes an increase in people who want to explore their alternatives in a different country. This post is for you.\n\nFirst, some reminders:\n\n* In most cases, moving abroad is not as simple or quick as it seems in movies. If you aren't a citizen of another country, you will probably require a visa (=legal permission) from that country based on something like employment, education, or ancestry.\n* The sidebar of this subreddit has a lot of helpful resources, and we have 15 years of posts from people with similar situations to yours. Before posting, please review these resources first. (Tip: If reddit search isn't working well for you, try googling \"[your search terms] site:reddit.com\\/r/IWantOut\" without the quotes or brackets.)\n* Most countries and/or their embassies maintain immigration websites with clear, helpful, updated guides or even questionnaires to help you determine if/how you can qualify. If you have a particular destination in mind, that should probably be your first stop.\n* After that, if you want to make your own post, please follow the formatting instructions on the submission page, give as much information as possible about your situation, and be open to advice and constructive criticism from commenters.\n\nAlso, this subreddit is intended to be a friendly community to seek and give advice on legal immigration. As such, please:\n\n* Don't fight about politics. We understand that you may have strong feelings about it, but there are better spaces on reddit and elsewhere for general political discussions.\n* Keep your feedback constructive and kind, even when telling someone they're wrong.\n* Don't troll or be a jerk.\n* Don't request or give illegal immigration tips, including asking strangers to marry you.\n\nFailure to follow these and the other subreddit rules may result in a ban.\n\nThat said, feel free to comment below with some general questions, concerns, comments, or advice which doesn't merit a full post. Hopefully this will help clarify your thoughts and ideas about the possibility of leaving the US. Once again, please try to stay on topic so that this thread can be a helpful resource.",
    "is_self": true,
    "link_flair_text": null,
    "comments": [
      {
        "comment_id": "lvpgnid",
        "author": "elpablo1940",
        "body": "I have no useful skills abroad, I'm screwed and I know it lol.",
        "score": 472,
        "created_utc": 1730900036.0,
        "created_datetime": "2024-11-06T14:33:56",
        "parent_id": "t3_1gkv77m",
        "is_submitter": false
      },
      {
        "comment_id": "lvq2817",
        "author": "fahhgedaboutit",
        "body": "I moved to england and lived there for 6 years because I wanted out after the 2016 election, but it took years of planning and I didn’t make it there until 2018. I entered on a student visa, switched to a work visa, then I would’ve been able to get a marriage-based visa if I wanted to stay. \n\nJust a reminder that if you’re that desperate, the US government will let you bury yourself in loans to go study abroad, which opens up work possibilities in that country most of the time :D",
        "score": 221,
        "created_utc": 1730906298.0,
        "created_datetime": "2024-11-06T16:18:18",
        "parent_id": "t3_1gkv77m",
        "is_submitter": false
      },
      {
        "comment_id": "lvpxhqx",
        "author": "Team503",
        "body": "F**or the vast majority of countries, to immigrate you must fall into one of the following categories:**\n\n* Citizenship by descent (usually parents, sometimes grandparents)\n* Marry a citizen of the desired nation\n* Apply to (and be accepted) a post-secondary educational institution (university) and have enough money to pay for both school and support yourself, cash in hand\n* **Obtain a job offer in a limited set of fields**, usually called Critical Skills or similar that usually involves highly skilled roles such as programmers, engineers, architects, doctors, and similar\n* Retire with a significant amount of passive income (usually 50k per person or more)\n* Be a significant enough artist to obtain an artists visa (if you have to ask, you don't qualify)\n* In a very small number of countries, you can buy your way in, usually starting a 500k or more in liquid funds\n\n**There's a few exceptions here and there, but for most places, that's it.**  And barring the first two, you will need to be proficient to a specific level in the local language, usually B1 or better (which is at least \"conversational\") with few exceptions.  The vast majority of successful immigrants from the US are those who obtain work permits\n\n**Even if you have the skills, getting a job that will sponsor a work permit is HARD and relatively rare.**  You probably won't get one straight out of college or new to your field, they usually go to mid-career experienced professionals, but there are exceptions.\n\n**It's expensive.**  It doesn't matter where you move to, you have to purchase international flights, ship your belongings (don't, sell most of what you own and replace it when you arrive), rent a place (which in most of the world requires first and last month's rent up front, and sometimes an additional month's rent as deposit), and build a new life.  You'll need to maintain a US based bank account and at least one in your new nation (I usually recommend Wise, formerly WiseTransfer, to deal with your international banking needs if you're headed to the EU or UK, as its easy to move money between currencies and accounts at reliable exchange rates).\n\n**I'd say that for a couple, to make a move, you're going to need $10-15,000** \\- airfare for two including extra luggage (cheaper than shipping usually), first and last month's rent, deposit, a month at a hotel/AirBNB/VRBO while you're finding a place to rent, and money to live on.  Most places in the EU pay once a month at the end of the month, not every two weeks like the US, so there is a delay, and you will likely be paying emergency tax rates for the first month or two while you get set up in your local tax bureaucracy.  Add a few thousand more if you intend to get a license and buy a car, but be aware that most places won't accept your US license in trade, you'll have to take courses and test all over again, and it can be both expensive and take a while (it adds up to about 1500e in Ireland last I looked and taxes six-ish months).\n\n**Even in English speaking countries like Ireland or Australia you will encounter MASSIVE culture shock.**  Nowhere is as open and friendly as the US.  You will be expected to assimilate to a new, foreign culture with all kinds of different norms you will spend *years* figuring out.  And yes, as an American, your normal conversational tone is about 50% too loud.  It takes about six months to get used to that in my experience.  Business communication, too, is very different and you will need to adapt.\n\n**It is unlikely that a nation with single payer health care will accept you if you have significant medical needs.**  Some countries, like Australia, have a list of conditions that are banned from immigrating.  Others, like Ireland, don't.  If you can't work - you live on disability or a similar government welfare scheme - you will not be accepted as an immigrant, legally speaking, by most anywhere.  I cannot think of a place that would accept someone in that situation unless they were a citizen by descent or married to a citizen (ie not entering the nation on their own merits).\n\nIn short you have to have something to offer your new nation, and you have to make the effort to fit in, and you better bring the skills and the cash to do it.",
        "score": 256,
        "created_utc": 1730904990.0,
        "created_datetime": "2024-11-06T15:56:30",
        "parent_id": "t3_1gkv77m",
        "is_submitter": false
      }
    ],
    "keyword_analysis": {
      "found_keywords": {
        "deposit": "bank_account"
      },
      "found_categories": [
        "bank_account"
      ],
      "has_relevant_keywords": true,
      "keyword_count": 1
    },
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post and comments primarily discuss emigrating from the US after election results, focusing on the challenges and processes involved in moving ab",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 2
  },
  {
    "subreddit": "IWantOut",
    "post_id": "gqhlfw",
    "title": "[GUIDE] So you're an American who wants to live in Europe, eh?",
    "author": "Purdue49OSU20",
    "score": 3159,
    "upvote_ratio": 0.97,
    "num_comments": 704,
    "created_utc": 1590435164.0,
    "created_datetime": "2020-05-25T21:32:44",
    "url": "https://www.reddit.com/r/IWantOut/comments/gqhlfw/guide_so_youre_an_american_who_wants_to_live_in/",
    "permalink": "https://reddit.com/r/IWantOut/comments/gqhlfw/guide_so_youre_an_american_who_wants_to_live_in/",
    "selftext": "Hi all, I wanted to put together a brief overview or sort of wiki thing for one of the biggest groups I see on here: Americans wanting to move to Europe.  If you have questions or more to add (or you disagree!) please leave a comment and I can edit my post accordingly.  \n\nDISCLOSURE: I'm just an American guy who did it myself, and I see a lot of people who seem to want to move to Europe. Your experience may vary... dramatically.  I'm sure plenty of people will take exception   \n  \n#So you want to move to Europe, huh?  \nWelp, you're probably not the first person to think of that.  Before you make the leap, I think it would be helpful to hear a few things from someone who has done the leap before.  Twice, actually.  \n  \n*My background:* I am a 35 year old college degreed (Bachelor's degree only) man with a wife and two kids.  When I moved to Germany in 2014, I was only a US Citizen, though I was pursuing Italian Citizenship via Jure Sanguinis. My first move to Europe had me qualifying via a Blue Card, but now I have an Italian passport and moved back to Germany this year.  \n  \nOK, enough about me.  Before you move, you need to really think about what you're trying to accomplish by moving to Europe.  \n  \n**Why do you want to move?**  \n  \n* *\"The politics are just too much!\"*  \nThis is probably the number one reason I see as to why people have decided that now is the time for them to move.  Interestingly, this argument tends to increase in popularity as we get closer to a Presidential Election. It's true, American politics are increasingly hostile, and as one watches TV (on any side of the spectrum) all they can see is more division.  \n  \n  While this is certainly true, I will remind you that just because you're ignorant of politics in Europe doesn't mean that they're any less divisive.  Hungary has a de facto dictatorship.  Poland is edging that way as well.  Germany has seen the rise of nationalistic politics and so has Italy.  Fact of the matter is, political tensions globally are rising at a dramatic clip.  *\"Yeah well, at least I'll be blissfully ignorant\"* you may respond, but if that is the case, it would just be a lot simpler for you to turn off your TV, stop reading Facebook and Twitter, and build like minded friendships than moving yourself half a lifetime away.  \n  \n* *\"The healthcare though!\"*  \n  Yep, this is going to be a big one, I'm sure.  The truth is that healthcare isn't always as cheap as it's hinted in the US, but it on the whole is better.  Every country takes a different approach.  For Germany, I was eligible for a choice between public and private insurance.  Private insurance cost me about 700 Euro a month for my wife and I, and it opens the doors to top notch care, no waits, and really a totally different system.  Friends in the public system sometimes dealt with waits, a little less choice, but nothing remotely miserable.  Quality of care is a lot different as well, with a focus on the patient rather than falling back on pharmaceutical drugs.  But I just included this to remind everyone that it's not free-free.  It's funded by higher taxes, or if you're in the private system also, taxes and decently high monthly premiums.  The good news is that 700 EUR/month covered 100% of everything I had to pay. My oldest child was born in Germany and we paid 450 EUR out of pocket, because I stayed in a bed for five nights with my wife to help take care of the baby.  Otherwise it would've been completely free.   \n  \n* *\"I just want to be somewhere different!\"*  \n  I think there's probably a lot more diversity, opportunity, and lower risk by staying in the US.  From the Pacific Northwest, to the Great Plains, to Hawaii to the Virgin Islands, the US Passport gives you access to live in a variety of climates, political landscapes, and with a lot more economic opportunity.  Which brings us to my next point.  \n  \n* *\"But I went on vacation and I just fell in love with it\"*  \n  Yeah dude, I go on vacation in Italy once a year and love every moment of it.  What I wouldn't love?  Waiting a month to get the cable or internet guy to show up to my apartment.  Sure the pace is cute when you're on vacation and have no need to do anything particularly quickly, but there's a huge difference between \"Life on Vacation\" and \"Life in the real world\".  In a lot of places you will likely be unable to afford (or want to live in) the touristy areas (which are overcrowded due to tourists like you once were).  Obviously tourism also keeps prices higher than they would be for the normal local economy, which we'll come back to later.   \n  \n  \n\n**Do you realize moving to a foreign country sucks?**   \n  \n\n  OK, yes, I've done it twice now.  But suggesting that it's \"easy\" by any stretch of the imagination would be laughable at best.  Moving to a foreign country means dealing with differences, many of them bigger than any differences you've ever had to deal with in your life.  The cultural differences can be massive, and can even hurt your professional life as you struggle to adjust.  \n  \n  * *\"Yeah but I went on vacation to XYZ and they said everyone speaks English there*  \n  Yes, this may be the case that most educated people speak English in a particular country, and you can probably *mostly* get around speaking English in places like Amsterdam or Berlin.  But the fact of the matter is that most government offices (which you'll be spending a lot of time in, especially at first) and contracts will be in the local language, so as to not have any confusion about what the author's intent is.  Plus, once you get a place to live, if your pipe breaks at 2 AM, you'll need to call someone who can come fix it immediately, and you'll have to be able to communicate what the problem is to him or her.  \n    \n  * *\"OK but the language is fine, I studied it in school and stuff\"*  \n    Sure, but then there's the culture.  Things that are the norm in the US are not the norm in Europe and vice versa.  It's not even things like personal space, it could be office norms (Germany as an example is very hierarchical, so if you go for an office job, expect to be told what to do, unless it's a very international firm), outlook (Americans are very optimistic as a whole, and it is not well appreciated in all countries in Europe).  \n  \n  \nBesides these things, there's the elements of just moving to a place where you don't know anyone, have very few common cultural experiences with which to build friendships, and perhaps other European cultures are less friendship inclined than America (my experience is that it has been very tough to make German friends due to them tending to stay in their own friends circle from their early adult years throughout the remainder of their life)  \n   \n**You may not be welcome here**   \nOK so a few elements to this.  First of all, in a foreign country in which you aren't a citizen, you are, by default, a guest.  That means that at any time, you could be potentially deported if you Fuck Up Real Big™.  It doesn't happen a lot, but understand that you're at a huge disadvantage of not 1) Knowing the rules very well because you didn't grow up with the same rules.  2) Don't speak the language so you can't get yourself out of trouble as easily and 3) The local government doesn't need to put up with your shit if they don't want to, unlike a citizen.  \n  \nBut besides this, remember how you didn't like the American politics?  You know who else might not? Your neighbors, or your coworkers.  You know how some Americans have hostility towards immigrants for the perception of stealing their jobs?  Yeah, that exists everywhere and you're going to just have to deal with it.  For most Redditors, I'm assuming many of you are on the upper social rungs of society... As an expat or immigrant, you're brought down a few notches.   \n  \n**What would you say you do here?**  \n  \nI've seen a lot of posts where people have no education, skills, or language, and want to move to a particular European country.  Dude, really?  Going back to my previous point, you're about to be a guest in a country.  Who wants a guest who shows up to the party and just drinks too much of the host's beer, throws up on the coffee table, and breaks a vase before going home scot-free?  \n   \nEdit: A possible opportunity exists if you have Italian, Irish, or Jewish-German ancestry, in which case you may have a claim to citizenship. That is a great question to ask here on the sub.    \n  \n\nThis goes for \"free education\" too.  Coming to Europe simply to save on school fees (funded by taxpaying local citizens) and then going home?  Kind of a dick move, to be fair, and gives some people a bad reputation.  If you're truly looking to emigrate (for a long-ish time) then pursue the education, it's definitely your best way into Europe if you are at that stage of your life, but just make sure you find a way to provide value to your host country.  \n  \nIf you do have some semblance of job skills, your best bet is likely to pursue an opportunity through a multinational US corporation with a European presence.  That'll likely help you deal with the aforementioned cultural gaps (since they'll be used to American culture), and may allow you to get a visa through company transfer, rather than having to compete for a Blue Card or some other heavily contested visa.  \n  \nThe Blue Card is probably the best approach if you're a seasoned veteran.  That's how I was able to make my first European move, but it required me being an executive in an industry that's decently small for them to make the case that they couldn't find someone to do my job who already was within the EU.  If you have high skills and a strong career, you will have an easy path.  If you do not, the best way is to figure out how to get into this skillset in the US then transfer over.  (My opinion here only)  \n  \n**Are things really that bad for you? Is the grass really greener?**   \n  \nThe US offers unprecedented opportunity, a market of 350 million English speakers, geographic and cultural variety, and perhaps most important to some of you: **the world's strongest wage environment**.  Expect to take a 30-50% paycut if you move to Europe. My US company started analysts at $60,000 per year.  The company in Europe I went to had the same role and they made 28,000 EUR.  Coupled with the taxes, your take home will be a lot less.  Sure, you might spend less on rent, healthcare, car, etc., but it's something to think about before pulling the trgger.  \n  \nOther things to consider:   \n  \n* Do you really want to be a 6+ hour flight from your family in case things go wrong?  Sure, maybe your parents are healthy now, but they might not be forever, and if something happens and you're the only child (or you have a strong family attachment), that last second transatlantic flight will be ... very... expensive.   \n* Are you more culturally attached to the US than you think?  For me, being 6 hours ahead during sports seasons was *brutal*.  Easily the thing I missed the most about the US.  But this can be applicable to a million different things.  \n* Having one foot in Europe and one in the US is frustrating for: taxes, family life (if you meet a European spouse and have kids, the kids won't have the same growing up experience as one of the parents, if that's important) and a lot of other things.  Be careful!  \n  \nThat's all I have for now, but I'm sure more things will pop into my head.  \n  \nIf you're still not scared through all this, go for it.  It's very rewarding, but it'll be a huge challenge (and for those of us who love the challenge, it makes you a better person!)",
    "is_self": true,
    "link_flair_text": "Guide",
    "comments": [
      {
        "comment_id": "frt72cf",
        "author": "matt_seydel",
        "body": "There's a lot of truth in here that people need to grasp to gauge whether moving to a European country is possible, plausible, and desirable for them and/or their family. I moved to Sweden in 2018, securing a work visa in a niche area of IT consulting, and my wife was able to  shift her U.S. job through a third-party EU company. These two factors probably put us in the top 1% of expat prospects, where my consulting  company worked with us on relocation and housing. We had to work hard to position ourselves for this move, and even so, the first several months, though exciting, were often breathtakingly challenging for us and our kids. We really like living in Sweden, but our stay is entirely dependent on work visa renewals. As an American, your concept of personal rights needs to be overhauled to live abroad. There are many posters who are 'fed up' with the U.S., but i think OP is trying to point out that you need a more affirming reason and skills that add value to successfully transplant yourself. And you need to be secure enough mentally and emotionally  to potentially be an outsider for a long time, if not forever. Edit: minor bit of controversial advice, if you do make the expat leap with a family; put your kids in a local school to immerse in the language.",
        "score": 517,
        "created_utc": 1590444461.0,
        "created_datetime": "2020-05-26T00:07:41",
        "parent_id": "t3_gqhlfw",
        "is_submitter": false
      },
      {
        "comment_id": "frt059w",
        "author": "L_boddah",
        "body": "I notice that there are too mant us to eu posts. Is it because number of us redditors or eu is overall better than us?",
        "score": 107,
        "created_utc": 1590440753.0,
        "created_datetime": "2020-05-25T23:05:53",
        "parent_id": "t3_gqhlfw",
        "is_submitter": false
      },
      {
        "comment_id": "frupdi7",
        "author": "enrtcode",
        "body": "Portugal from USA here\n\nMost of what you said is true to an extent. Healthcare here is MUCH cheaper for private here.  I pay only 30€ a month for mine including dental.  Its wonderful.  \n\nIf you want to do business here in any level above a call center you must speak Portuguese.  Yes as a tourist everyone speaks English for the most part but if you intend to live and start a business its absolutely necessary.  \n\nRemember.  All paperwork, all things you must do as a resident all is in Portuguese.  It's simple to do the things here most is automated but again the fact that it's all in a foreign language makes it harder.  \n\nMAKE YOUR KIDS GO TO A LOCAL LANGUAGE SCHOOL.  I know expats who have lived here for years and only send thier kids to the English speaking school.  My daughter learned Portuguese in 1 year at her private international school that speaks Portuguese as a main language in school, English secondary.  Kids are amazing and will adapt faster than you.  \n\nLanguage is a gift that will be with them for life",
        "score": 90,
        "created_utc": 1590481876.0,
        "created_datetime": "2020-05-26T10:31:16",
        "parent_id": "t3_gqhlfw",
        "is_submitter": false
      },
      {
        "comment_id": "frt3yfl",
        "author": "imacutetrashcan",
        "body": "If any of you guys looking to move to Europe are still pretty young, why not try going to Europe on a student visa? If you’re a really good student, you could get into a university in Norway or Germany and (mostly) avoid having to pay tuition (of course you need to factor in the cost of living and obtaining a visa). Even living abroad for a year would give you an appropriate taste of what it’s like to live in your country of choice.\n\nIt’s definitely not for everyone though. I have friends who studied abroad and it made them realise how much they love life in the US. I went to Scotland to do my Master’s degree and felt like I fit in better there than anywhere I’ve lived in the US.\n\nI know it’s not financially feasible for everyone, but it’s definitely worth considering. Plus, some countries make it easier for you to get a work visa if you go to university there.",
        "score": 400,
        "created_utc": 1590442777.0,
        "created_datetime": "2020-05-25T23:39:37",
        "parent_id": "t3_gqhlfw",
        "is_submitter": false
      },
      {
        "comment_id": "frt7q5e",
        "author": "Maybird56",
        "body": "Having lived in another country I think was one of the most eye opening and interesting things I've ever done. I wish everyone was fortunate enough to have the opportunity to do so if they wish. It's definitely very difficult and comes with a lot of struggles that I don't think can be anticipated until you make the leap. \n\nI'm back in the US and we're thinking about making a big move in a year or so. We're considering Europe (haven't decided where yet), so it was interesting to read your post.",
        "score": 51,
        "created_utc": 1590444825.0,
        "created_datetime": "2020-05-26T00:13:45",
        "parent_id": "t3_gqhlfw",
        "is_submitter": false
      }
    ],
    "keyword_analysis": {
      "found_keywords": {
        "renewal": "visa",
        "premium": "insurance",
        "claim": "insurance"
      },
      "found_categories": [
        "visa",
        "insurance"
      ],
      "has_relevant_keywords": true,
      "keyword_count": 3
    },
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"While the post discusses moving to Europe from the US, it does not primarily focus on visa processes, insurance specifics, or other administrative aspects o",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 2
  },
  {
    "subreddit": "IWantOut",
    "post_id": "1gkv77m",
    "title": "MEGATHREAD: Emigrating after the US election results",
    "author": "spacemanaut",
    "score": 2044,
    "upvote_ratio": 0.89,
    "num_comments": 2005,
    "created_utc": 1730887752.0,
    "created_datetime": "2024-11-06T11:09:12",
    "url": "https://www.reddit.com/r/IWantOut/comments/1gkv77m/megathread_emigrating_after_the_us_election/",
    "permalink": "https://reddit.com/r/IWantOut/comments/1gkv77m/megathread_emigrating_after_the_us_election/",
    "selftext": "Every US election brings anxiety and uncertainty, and with that comes an increase in people who want to explore their alternatives in a different country. This post is for you.\n\nFirst, some reminders:\n\n* In most cases, moving abroad is not as simple or quick as it seems in movies. If you aren't a citizen of another country, you will probably require a visa (=legal permission) from that country based on something like employment, education, or ancestry.\n* The sidebar of this subreddit has a lot of helpful resources, and we have 15 years of posts from people with similar situations to yours. Before posting, please review these resources first. (Tip: If reddit search isn't working well for you, try googling \"[your search terms] site:reddit.com\\/r/IWantOut\" without the quotes or brackets.)\n* Most countries and/or their embassies maintain immigration websites with clear, helpful, updated guides or even questionnaires to help you determine if/how you can qualify. If you have a particular destination in mind, that should probably be your first stop.\n* After that, if you want to make your own post, please follow the formatting instructions on the submission page, give as much information as possible about your situation, and be open to advice and constructive criticism from commenters.\n\nAlso, this subreddit is intended to be a friendly community to seek and give advice on legal immigration. As such, please:\n\n* Don't fight about politics. We understand that you may have strong feelings about it, but there are better spaces on reddit and elsewhere for general political discussions.\n* Keep your feedback constructive and kind, even when telling someone they're wrong.\n* Don't troll or be a jerk.\n* Don't request or give illegal immigration tips, including asking strangers to marry you.\n\nFailure to follow these and the other subreddit rules may result in a ban.\n\nThat said, feel free to comment below with some general questions, concerns, comments, or advice which doesn't merit a full post. Hopefully this will help clarify your thoughts and ideas about the possibility of leaving the US. Once again, please try to stay on topic so that this thread can be a helpful resource.",
    "is_self": true,
    "link_flair_text": null,
    "comments": [
      {
        "comment_id": "lvpgnid",
        "author": "elpablo1940",
        "body": "I have no useful skills abroad, I'm screwed and I know it lol.",
        "score": 478,
        "created_utc": 1730900036.0,
        "created_datetime": "2024-11-06T14:33:56",
        "parent_id": "t3_1gkv77m",
        "is_submitter": false
      },
      {
        "comment_id": "lvq2817",
        "author": "fahhgedaboutit",
        "body": "I moved to england and lived there for 6 years because I wanted out after the 2016 election, but it took years of planning and I didn’t make it there until 2018. I entered on a student visa, switched to a work visa, then I would’ve been able to get a marriage-based visa if I wanted to stay. \n\nJust a reminder that if you’re that desperate, the US government will let you bury yourself in loans to go study abroad, which opens up work possibilities in that country most of the time :D",
        "score": 215,
        "created_utc": 1730906298.0,
        "created_datetime": "2024-11-06T16:18:18",
        "parent_id": "t3_1gkv77m",
        "is_submitter": false
      },
      {
        "comment_id": "lvpxhqx",
        "author": "Team503",
        "body": "F**or the vast majority of countries, to immigrate you must fall into one of the following categories:**\n\n* Citizenship by descent (usually parents, sometimes grandparents)\n* Marry a citizen of the desired nation\n* Apply to (and be accepted) a post-secondary educational institution (university) and have enough money to pay for both school and support yourself, cash in hand\n* **Obtain a job offer in a limited set of fields**, usually called Critical Skills or similar that usually involves highly skilled roles such as programmers, engineers, architects, doctors, and similar\n* Retire with a significant amount of passive income (usually 50k per person or more)\n* Be a significant enough artist to obtain an artists visa (if you have to ask, you don't qualify)\n* In a very small number of countries, you can buy your way in, usually starting a 500k or more in liquid funds\n\n**There's a few exceptions here and there, but for most places, that's it.**  And barring the first two, you will need to be proficient to a specific level in the local language, usually B1 or better (which is at least \"conversational\") with few exceptions.  The vast majority of successful immigrants from the US are those who obtain work permits\n\n**Even if you have the skills, getting a job that will sponsor a work permit is HARD and relatively rare.**  You probably won't get one straight out of college or new to your field, they usually go to mid-career experienced professionals, but there are exceptions.\n\n**It's expensive.**  It doesn't matter where you move to, you have to purchase international flights, ship your belongings (don't, sell most of what you own and replace it when you arrive), rent a place (which in most of the world requires first and last month's rent up front, and sometimes an additional month's rent as deposit), and build a new life.  You'll need to maintain a US based bank account and at least one in your new nation (I usually recommend Wise, formerly WiseTransfer, to deal with your international banking needs if you're headed to the EU or UK, as its easy to move money between currencies and accounts at reliable exchange rates).\n\n**I'd say that for a couple, to make a move, you're going to need $10-15,000** \\- airfare for two including extra luggage (cheaper than shipping usually), first and last month's rent, deposit, a month at a hotel/AirBNB/VRBO while you're finding a place to rent, and money to live on.  Most places in the EU pay once a month at the end of the month, not every two weeks like the US, so there is a delay, and you will likely be paying emergency tax rates for the first month or two while you get set up in your local tax bureaucracy.  Add a few thousand more if you intend to get a license and buy a car, but be aware that most places won't accept your US license in trade, you'll have to take courses and test all over again, and it can be both expensive and take a while (it adds up to about 1500e in Ireland last I looked and taxes six-ish months).\n\n**Even in English speaking countries like Ireland or Australia you will encounter MASSIVE culture shock.**  Nowhere is as open and friendly as the US.  You will be expected to assimilate to a new, foreign culture with all kinds of different norms you will spend *years* figuring out.  And yes, as an American, your normal conversational tone is about 50% too loud.  It takes about six months to get used to that in my experience.  Business communication, too, is very different and you will need to adapt.\n\n**It is unlikely that a nation with single payer health care will accept you if you have significant medical needs.**  Some countries, like Australia, have a list of conditions that are banned from immigrating.  Others, like Ireland, don't.  If you can't work - you live on disability or a similar government welfare scheme - you will not be accepted as an immigrant, legally speaking, by most anywhere.  I cannot think of a place that would accept someone in that situation unless they were a citizen by descent or married to a citizen (ie not entering the nation on their own merits).\n\nIn short you have to have something to offer your new nation, and you have to make the effort to fit in, and you better bring the skills and the cash to do it.",
        "score": 251,
        "created_utc": 1730904990.0,
        "created_datetime": "2024-11-06T15:56:30",
        "parent_id": "t3_1gkv77m",
        "is_submitter": false
      }
    ],
    "keyword_analysis": {
      "found_keywords": {
        "deposit": "bank_account"
      },
      "found_categories": [
        "bank_account"
      ],
      "has_relevant_keywords": true,
      "keyword_count": 1
    },
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post and comments primarily discuss emigrating from the US after election results, focusing on the challenges and processes involved. While some ",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 2
  },
  {
    "subreddit": "IWantOut",
    "post_id": "t123a9",
    "title": "Megathread for Ukrainians Seeking Asylum",
    "author": "whiteraven4",
    "score": 1437,
    "upvote_ratio": 0.99,
    "num_comments": 217,
    "created_utc": 1645789518.0,
    "created_datetime": "2022-02-25T12:45:18",
    "url": "https://www.reddit.com/r/IWantOut/comments/t123a9/megathread_for_ukrainians_seeking_asylum/",
    "permalink": "https://reddit.com/r/IWantOut/comments/t123a9/megathread_for_ukrainians_seeking_asylum/",
    "selftext": "Need advise on how to claim asylum? Have some good resources to help others? Post them here.\n\nWe currently will still allow individual posts. However, if things get out of hand and too difficult to effectively moderate, we may only allow separate posts after individual consideration.\n\nPlease keep things civil and report any inappropriate comments. We cannot read every single comment and depend on the community to help keep things civil and on topic.",
    "is_self": true,
    "link_flair_text": null,
    "comments": [
      {
        "comment_id": "hydhdcq",
        "author": "[deleted]",
        "body": "Canada is accepting Ukrainian refugees as a priority. The government said that you can fly to Canada from Poland, Slovakia, Moldova, or Romania.\n\nThey have set an international phone number (+1 613-321-4243), more info here https://www.canada.ca/en/immigration-refugees-citizenship/news/2022/02/additional-immigration-support-for-those-affected-by-the-situation-in-ukraine.html\n\nWe have a large Ukrainian diaspora by the way, you are welcome here.",
        "score": 250,
        "created_utc": 1645793269.0,
        "created_datetime": "2022-02-25T13:47:49",
        "parent_id": "t3_t123a9",
        "is_submitter": false
      },
      {
        "comment_id": "hyddgkx",
        "author": "vardonir",
        "body": "The Polish government has a website for Ukrainians seeking asylum, in 4 languages: https://www.gov.pl/web/udsc/ukraina",
        "score": 112,
        "created_utc": 1645790915.0,
        "created_datetime": "2022-02-25T13:08:35",
        "parent_id": "t3_t123a9",
        "is_submitter": false
      },
      {
        "comment_id": "hydm14p",
        "author": "ruber_r",
        "body": "Czech republic is inviting Ukrainians, with or without passport. No deportations. You can overstay your visa-free 90 days. You can get legal status (refugee, student etc.). If you are in Czechia on regular visa and it should expire, you are entitled to prolongation. Ukrainian nationals who register as refugees are immediately able to work legally and are also part of public health insurance (free of charge). We have refugee centers in bigger cities that help people without local family/friends.\n\nRefugees from Ukraine can take their pets with them. Usual EU import regulations (microchip and rabies vaccine) have been suspended. You just have to vaccinate and microchip your dog or cat after arrival here. Most vets will treat your animals for free or at reduced cost.",
        "score": 89,
        "created_utc": 1645795793.0,
        "created_datetime": "2022-02-25T14:29:53",
        "parent_id": "t3_t123a9",
        "is_submitter": false
      },
      {
        "comment_id": "hydpqkn",
        "author": "[deleted]",
        "body": "[tips on how to survive from a Bosnia war survivor](https://www.reddit.com/r/ukraine/comments/t0dby0/tips_on_how_to_survive_a_war_zone_as_a_civilian/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
        "score": 77,
        "created_utc": 1645797609.0,
        "created_datetime": "2022-02-25T15:00:09",
        "parent_id": "t3_t123a9",
        "is_submitter": false
      },
      {
        "comment_id": "hydhahg",
        "author": "stateofyou",
        "body": "Romania is accepting Ukrainian citizens",
        "score": 46,
        "created_utc": 1645793223.0,
        "created_datetime": "2022-02-25T13:47:03",
        "parent_id": "t3_t123a9",
        "is_submitter": false
      }
    ],
    "keyword_analysis": {
      "found_keywords": {
        "overstay": "visa",
        "claim": "insurance"
      },
      "found_categories": [
        "visa",
        "insurance"
      ],
      "has_relevant_keywords": true,
      "keyword_count": 2
    },
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"While the post and comments mention keywords like 'overstay' and 'claim', the primary focus is on providing resources and information for Ukrainians seeking",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 2
  },
  {
    "subreddit": "IWantOut",
    "post_id": "t3buck",
    "title": "Megathread for Russians seeking advice",
    "author": "whiteraven4",
    "score": 1092,
    "upvote_ratio": 0.98,
    "num_comments": 393,
    "created_utc": 1646041041.0,
    "created_datetime": "2022-02-28T10:37:21",
    "url": "https://www.reddit.com/r/IWantOut/comments/t3buck/megathread_for_russians_seeking_advice/",
    "permalink": "https://reddit.com/r/IWantOut/comments/t3buck/megathread_for_russians_seeking_advice/",
    "selftext": "Due to the large number of posts from Russians, we'll try also having a megathread for Russians. I'm not sure if this will be as helpful since the situation in the case of Russians is very individualistic, but let's give it a try.\n\nSame rules apply, individual posts won't be banned as long as everything is kept civil.\n\nIt's not letting me sticky comments, but this website may be useful.\n\n[https://www.reddit.com/r/IWantOut/comments/t3buck/megathread\\_for\\_russians\\_seeking\\_advice/i3pxvdo/](https://www.reddit.com/r/IWantOut/comments/t3buck/megathread_for_russians_seeking_advice/i3pxvdo/)",
    "is_self": true,
    "link_flair_text": null,
    "comments": [
      {
        "comment_id": "hyub8hc",
        "author": "Kigeca",
        "body": "Wife stuck in Russia. Any safe corridor for her (I was thinking about Turkey). She has Italian citizenship, so it should be “easy” to leave. Unfortunately the normal Russians r going to suffer about the idiot in the cremlin… Thank you",
        "score": 158,
        "created_utc": 1646089741.0,
        "created_datetime": "2022-03-01T00:09:01",
        "parent_id": "t3_t3buck",
        "is_submitter": false
      },
      {
        "comment_id": "i10hnv2",
        "author": "MajesticS7777",
        "body": "I'm a 30 y.o. Russian male living with a 21 y.o. boyfriend, and we want out before the country falls apart. We are anti-war, but we've never advocated it openly. Same with our sexual orientation, we've been hiding it well enough to never get into any trouble. We aren't rich - we're average guys who live in perpetual debt because Russian job market is a joke and we don't have any highly sought-after qualifications. I've graduated as a sociologist in an never-heard-about university of a middle-of-nowhere city and worked desk potato manager jobs all my life, like call center jobs; my boyfriend trained as an architect but never finished it because Russian free education is so free he couldn't afford it. That said, we're both ready to learn and do our best, and we both know English well enough.\n\nWe'd love to move to a liberal, chill-with-minorities country - like US, Canada, England, or places like Germany, Czech Republic, etc. But I realize that we aren't skilled or wealthy enough for that, so the situation feels kinda hopeless. Does anyone have any ideas?",
        "score": 70,
        "created_utc": 1647522101.0,
        "created_datetime": "2022-03-17T14:01:41",
        "parent_id": "t3_t3buck",
        "is_submitter": false
      },
      {
        "comment_id": "hyrh3x5",
        "author": "the_nomads",
        "body": "Any ideas for a family in Belarus that wants out? With the border effectively closed by Belarus to prevent people from leaving we are having trouble coming up with a plan for my wife's sister and her family getting out of there. Time is not on their side as they are afraid that males will be forcibly conscripted and are looking to get out ASAP.",
        "score": 104,
        "created_utc": 1646044210.0,
        "created_datetime": "2022-02-28T11:30:10",
        "parent_id": "t3_t3buck",
        "is_submitter": false
      },
      {
        "comment_id": "hysaphz",
        "author": "[deleted]",
        "body": "I'm surprised at the amount of people who have zero experience in immigration-applicable employable skills are \"desperate to get out to anywhere\" but are still picky as hell with their destination. \n\nIf you're short on cash, skills, and degrees, wake the fuck up and consider moving to the third world. Unless you're Jewish and have the documentation for it, in which case, you're getting a free flight to Israel.",
        "score": 114,
        "created_utc": 1646061281.0,
        "created_datetime": "2022-02-28T16:14:41",
        "parent_id": "t3_t3buck",
        "is_submitter": false
      },
      {
        "comment_id": "hyrn9y4",
        "author": "SergeiGo99",
        "body": "M23 with a Master’s Degree in Linguistics and Spanish from a British university and 3 years’ work experience in tourism and hospitality and 3 years in the creative industry (graphic design, copywriting, translation/localisation and video/audio editing). Around £3K savings and a Russian passport. No residence permits or valid visas at the moment. Considering pretty much all industries and jobs.",
        "score": 56,
        "created_utc": 1646048920.0,
        "created_datetime": "2022-02-28T12:48:40",
        "parent_id": "t3_t3buck",
        "is_submitter": false
      }
    ],
    "keyword_analysis": {
      "found_keywords": {
        "documentation": "visa"
      },
      "found_categories": [
        "visa"
      ],
      "has_relevant_keywords": true,
      "keyword_count": 1
    },
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"While the post and comments mention individuals seeking to leave Russia and Belarus, the primary focus is on seeking general advice and escape strategies du",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 2
  },
  {
    "subreddit": "IWantOut",
    "post_id": "1kydjhz",
    "title": "[IWantOut] 21f Palestine-> Canada",
    "author": "Lee_or",
    "score": 1015,
    "upvote_ratio": 0.81,
    "num_comments": 514,
    "created_utc": 1748532112.0,
    "created_datetime": "2025-05-29T17:21:52",
    "url": "https://www.reddit.com/r/IWantOut/comments/1kydjhz/iwantout_21f_palestine_canada/",
    "permalink": "https://reddit.com/r/IWantOut/comments/1kydjhz/iwantout_21f_palestine_canada/",
    "selftext": "I’m 21. Woman. Palestinian (West Bank). Atheist.\nOne year left in a CS degree I hate.\nI just want to breathe and dance I think. Start over. Study something else.Live something that’s actually mine without shame, without fear, without being crushed by what it means to be a Palestinian ex-Muslim woman here.(What I wear, what I say, how I act, even how I think)\nSpoiler: I think everyone hates me.\n(My community,the “enemies.” - madness both sides -)\nI’ve been thinking about EU/Canada, but I have no idea what the hell to do or where to begin.\nHas anyone actually made it out?\nThrough study, asylum, anything?\n\nAny advice, experience would honestly mean a lot.\n\nI think I felt safer before I post this LMAO",
    "is_self": true,
    "link_flair_text": null,
    "comments": [
      {
        "comment_id": "muwc7yt",
        "author": "AutoModerator",
        "body": "This is just a **reminder** that political discussions are not welcome on /r/IWantOut. Our Rule 1 is to stay on topic and no politics.  This post has NOT been removed, this comment exists to limit the amount of political comments that appear on Israel related posts. Messaging modmail about this reminder may result in the post getting removed.\n\nThe current political situation in Israel/Palestine is a valid reason to desire immigration. However, we do not need excessive discussion of the current situation. That is best left to news and politics subreddits.\n\nAdditionally, advising people to not move to Israel because of the current situation is not welcome on our sub. Comments of this nature may result in comment removal or a ban.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IWantOut) if you have any questions or concerns.*",
        "score": 1,
        "created_utc": 1748532112.0,
        "created_datetime": "2025-05-29T17:21:52",
        "parent_id": "t3_1kydjhz",
        "is_submitter": false
      },
      {
        "comment_id": "muy6mgc",
        "author": "TravellingAmandine",
        "body": "Not the country you are asking for but a few Italian universities have scholarships for Palestinians. The deadline for applying expires soon, see [here](https://www.unict.it/it/corsi-numero-programmato/2025-2026/italian-universities-palestinian-students-iupals-call)",
        "score": 330,
        "created_utc": 1748550842.0,
        "created_datetime": "2025-05-29T22:34:02",
        "parent_id": "t3_1kydjhz",
        "is_submitter": false
      },
      {
        "comment_id": "muxbe5j",
        "author": "Sound_Saracen",
        "body": "If you're based in the west Bank you probably have some sort of right to abide in Jordan, not saying that Jordan is leagues better than the west Bank, however it can act as a stable platform for you to migrate to other countries if you manage to obtain Jordanian citizenship.",
        "score": 247,
        "created_utc": 1748541892.0,
        "created_datetime": "2025-05-29T20:04:52",
        "parent_id": "t3_1kydjhz",
        "is_submitter": false
      },
      {
        "comment_id": "muz9c4v",
        "author": "Undercoverghost001",
        "body": "Check out the secular rescue, they have very strict criteria, but maybe you fit. They also have good documentation in general : https://secular-rescue.org . I do not know their origin however. \nIf you are open to other options than canada there is also a pathway for atheist refugees in germany : https://atheist-refugees.com/en/the-asylum-procedure/ . Wishing you courage !",
        "score": 84,
        "created_utc": 1748562980.0,
        "created_datetime": "2025-05-30T01:56:20",
        "parent_id": "t3_1kydjhz",
        "is_submitter": false
      },
      {
        "comment_id": "mv5z0lt",
        "author": "[deleted]",
        "body": "I was a 21 year old atheist Israeli who never belonged and hate what people did to that beautiful land, when I left. I'm 45 now and have missed my family, the music, and food. Nothing else.\n\nMy plan was also Europe, but I ended up in Australia. I don't think I fully belong here either, but for different reasons, because I'm not from here and I never will be from here, I will always be an immigrant. But this sense of lack not belonging is a lot more comfortable. It's a lack of belonging that is emotionally a lot easier. Life here is much better. Less hatred and racism and religion and right-wing politics. I enjoy my life here. And my sons will never be forced into an army service - which I disagree with - it's a relief knowing they've grown up with no conflict and war. Life there is heavy and so freaking complicated. It's like you said, there's the enemy and then within our own people each we can be ostracised.\n\nI hope you find peace and happiness and a greater sense of belonging.",
        "score": 18,
        "created_utc": 1748651090.0,
        "created_datetime": "2025-05-31T02:24:50",
        "parent_id": "t3_1kydjhz",
        "is_submitter": false
      }
    ],
    "keyword_analysis": {
      "found_keywords": {
        "documentation": "visa"
      },
      "found_categories": [
        "visa"
      ],
      "has_relevant_keywords": true,
      "keyword_count": 1
    },
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"While the post mentions Canada and the EU as potential destinations, and implicitly involves the need for visas to move there, the primary focus is on the a",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 2
  },
  {
    "subreddit": "IWantOut",
    "post_id": "jlxybo",
    "title": "/r/IWantOut US Election Blackout is in effect until November 10th",
    "author": "Agent_Goldfish",
    "score": 933,
    "upvote_ratio": 0.95,
    "num_comments": 0,
    "created_utc": 1604212308.0,
    "created_datetime": "2020-11-01T07:31:48",
    "url": "https://www.reddit.com/r/IWantOut/comments/jlxybo/riwantout_us_election_blackout_is_in_effect_until/",
    "permalink": "https://reddit.com/r/IWantOut/comments/jlxybo/riwantout_us_election_blackout_is_in_effect_until/",
    "selftext": "### Why is this necessary?\n\nIn 2016, this sub was largely unreadable for a few weeks. That sucked for the readers of this sub. And it sucked for anyone who was looking for advice. Anyone looking to get out of the US had political comments all over their post. Anyone looking to move to the US had political comments. Even posts with people moving to/from countries with leaders similar in personality to the then president-elect had political comments on their posts. No one was getting advice. No valuable discussions were being had. It was just /r/politics except without the mod team and rules necessary to keep things under control. \n\nThere was also the phenomenon that happens after every presidential election, in which members of whatever party lost want to leave the country. This usually spawns the inevitable sticky post: \"You can't leave because your party lost an election, stop being ridiculous\". I'm hoping a blackout will preempt the need for that post.\n\nWe've implemented a number of methods to keep things under control. And for the most part, we have. This is out of an abundance of caution, especially if there's going to be a really dramatic \"election week\", which is looking more and more likely.  \n\nIf no post has the opportunity to spawn a US politics related argument, our hope is that those arguments won't appear on the sub. After the dust has settled, we're hoping people have calmed down enough and it won't be a problem.\n\nI cannot state this enough times: **This will NOT be a permanent policy**. Most of the mod team are Americans. Much of reddit is American. We're **NOT** going to permanently ban mention of the US, that's a ridiculous idea.\n\n### Why is the US election special? You haven't done this for any other election. What about the recent NZ election?\n\nSimple, **the US election is global news, and Americans make a plurality of redditors**. Seriously, my local paper in Germany has an article every day about the latest developments in the US election. That paper didn't tell me there was an election in NZ. The fact is, this election is personal to a larger percentage of redditors than any other election, and when things are personal, people get angry. There's also the fact that the US election does have impacts on people around the world, so a lot of people have a lot of opinions about the result. Compared to the recent kiwi election, where most people around the world are like, \"neat\".\n\nThe only other election in recent memory that could have had seen a similar policy enacted on our sub was the 2016 Brexit referendum. A lot of people were personally affected, and a lot of people had a lot of opinions about it. \n\nBut midterm elections in the US, while important, don't draw the same personal attachment/team sports aspect to them. Same with regular UK elections (for most of the world, I know those of you in the UK care a great deal about them). Or elections in basically any other country. This is a quite drastic policy, we're only doing it when crazy stuff happens.\n\n### Why are \"Elsewhere -> US posts\" removed?\n\nOne comment: \"Why would anyone want to move to the US?\". And then the shitshow starts. There's actually a lot of anti-Americanism in threads where people look to move to the US, and it's coming from Americans who can't grasp that there are good things about the US and that there are perfectly valid reasons to move to the US.\n\nThe whole idea is to limit the places where political discussions are even possible, so we're saying that for 10 days, you can't ask for advice moving to the US.\n\n### Why are \"US -> US posts\" removed?\n\nAgain, the point is to prevent any place where a political argument can spawn. It'll be hard to talk about election results in a post not related to the US, and anyone who tries to do so will be met with a ban.\n\n### What if I need immediate advice?\n\nOne thing about immigration is that nothing happens quickly. You having to wait 10 days to ask for advice is not going to make a difference in your ability to immigrate/move anywhere. If you're a non-American asking for general advice, just leave the US out of your question. If you're an American, sit tight. This will all be over soon, *I hope.*\n\nThe only exception to this is that the DV 2022 applications are due on November 10th. For anyone wishing to ask about DV (green card lottery) applications, feel free to message modmail, and we'll work with you to get a post approved. You can also go to /r/immigration, they're pretty good when it comes to US-specific immigration questions, especially with DV applications. \n\n### My favored candidate lost, and I need to leave the country immediately. Why can't I post?\n\nStop being ridiculous. \n\nFirst off, Americans basically can't go anywhere due to Covid restrictions. The election results won't change that. And part of immigration is being able to actually go somewhere. Also, we like to have serious discussions on this sub, with people who are seriously considering immigration. You wanting to rant about your chosen candidate losing might be cathartic for you, but it sucks for everyone here who wants to talk about immigration.\n\nIf you are serious about leaving, and you might be. Spend the next several days actually doing research, and then on November 10th, come on this sub and post your at least partially researched idea so we can help flesh it out for you.\n\n### I need to claim asylum because I'm a X and the winner of the election is X-phobic. Why can't I post?\n\n**Sigh**.\n\nWhile I understand that you're incredibly unhappy and maybe a little bit scared. That's not to say your fear is unfounded. If you are in danger, do your best to get out of danger. I don't believe this sub is the best place to come to for advice for getting out of danger. We're concerned with immigration, which is a notoriously slow process. If you need to get out of somewhere quick, I recommend looking for resources elsewhere. There are likely many X-specific subreddits on reddit, and they will definitely have stickies with the advice you're looking for.\n\nTo my knowledge, Americans have not been granted asylum for political reasons. That's not to say Americans can successfully receive asylum, a point that I've been corrected on in another [Meta] post. However, **the election will have absolutely no bearing on your ability to claim asylum**. \n\nJust because a certain person was elected doesn't mean that all of a sudden another country will grant you protection.\n\n\n### What if the election is a super calm event, we know the winner really quickly, and everything is hunky-dory?\n\nOh man, I wish. *I really wish.*\n\nIn that case, we'll likely lift the blackout early. The whole point is the prevent a political argument shitfest as happened in 2016. If things seem relatively relaxed, then the blackout could be over as soon as November 5/6. \n\n\n\n### Isn't this super easy to get past? Why couldn't I just use my state or my city?\n\nThis is why we have mods. If you're unaware of the blackout (meaning you posted and didn't both to read the sticky at the top of the sub), your post will be removed. \n\nIf you attempt to post and get filtered, and then decide to try and post again (we can see this in the mod log even if you delete the post from your account), you'll be faced with a ban likely longer than the blackout. \n\nDon't try to evade the blackout. Just wait.\n\n##### Is it blackout evasion to remove the US as a target country as a non-American looking to move to the US?\n\nNope. Here's an example:\n\nIf you post, \n\n> [IWantOut] 20-30X Italy -> Canada, UK, USA, Australia\n\nand this gets caught by the blackout filter, you **are** absolutely welcome to repost the following:\n\n> [IWantOut] 20-30X Italy -> Canada, UK, Australia\n\nAnd just not get advice about moving to the US. This is your decision to make, you can either take the advice you get about the other countries and post about the US later. Or wait until the blackout is lifted and post your full post.\n\nThat's your decision to make.",
    "is_self": true,
    "link_flair_text": null,
    "comments": [],
    "keyword_analysis": {
      "found_keywords": {
        "application": "visa",
        "claim": "insurance"
      },
      "found_categories": [
        "visa",
        "insurance"
      ],
      "has_relevant_keywords": true,
      "keyword_count": 2
    },
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post is primarily about the temporary silencing of political discussions on the subreddit during the US election period.  While the post mentions",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 2
  },
  {
    "subreddit": "IWantOut",
    "post_id": "a4l83b",
    "title": "Did you ever get frustrated when you decided to travel to a new country? I made a web app to help you get out by finding visa requirements for 200+ countries",
    "author": "1hakr",
    "score": 883,
    "upvote_ratio": 0.97,
    "num_comments": 93,
    "created_utc": 1544364707.0,
    "created_datetime": "2018-12-09T15:11:47",
    "url": "https://www.reddit.com/r/IWantOut/comments/a4l83b/did_you_ever_get_frustrated_when_you_decided_to/",
    "permalink": "https://reddit.com/r/IWantOut/comments/a4l83b/did_you_ever_get_frustrated_when_you_decided_to/",
    "selftext": "Hi Reddit!\n\nI love travelling and i spent the last 6 months trying to build [Visalist](https://visalist.io/?utm_source=reddit&utm_medium=launch&utm_campaign=iwantout). Now your quest for visa requirements research is over and you can travel tension free.\n\nHere's why I made this web app:  A year back I became a digital nomad and started traveling. I wanted to visit all the countries that I fancied. Soon I realized that you need a visa to most of these countries, few have VOA(Visa on Arrival) and for others, you have to get it through their embassy in your home country(in my case India). So now I wanted to see the countries I could go without waiting for 3 weeks to get a visa, did some research. After few blogs and websites finally got the list. Traveled to a new country. After few months I wanted to go to another country. I had to do the same search, couldn't find the old one, found a new site which had more countries offering VOA. One of my friends told me that when he researching for Vietnam visa, he found almost 10 websites with .gov and it was really confusing. Many blogs don't have links to official websites of embassies.\n\nTo summarize the problems:\n\n* No aggregated info of visa related info shown in a useful way.\n* Most of the existing blogs and website has very less info and are usually outdated.\n* Lot of research is needed even to go to a single country and this needs to be done every single time.\n* Difficult to find the official website and data on many websites is outdated.\n* Pay more than required money to visa agent's\n\nSo I took the matter into my own hands and decided to aggregate this info, organize and present it in a useful way to the user and so [Visalist](https://visalist.io/?utm_source=reddit&utm_medium=launch&utm_campaign=iwantout) was born. While I was talking to my friends about this, I realized many people wanted something similar from a long time. So what this has is\n\n* A simple way to find the basic requirements for all the countries you want to travel\n* Simplified visa requirements like visa-free, visa on arrival, visa not required, evisa, visa required and visa refused (Yes! For North Korea)\n* A simple map color-coded with visa requirements across the world so you can easily see which countries around you can easily travel to\n* Visa Requirement details like duration, documents checklist and other requirements for the stay\n* Which is the official website for that information\n\nI coded, designed and built Visa List using VueJS with NuxtJS for the frontend, MySQL for backend using Golang. I was originally an android developer and learned these just to build Visa List.\n\nI believe every person who wants to explore the world around them and would have faced the problem I faced, so could find value in what I have built. So I would love to know what you think of this and would be more than happy to hear your suggestions and feature requests. Let me know what you want to be added or removed or do I need to build something entirely!\n\nThanks! [@1HaKr](https://twitter.com/1HaKr)\n\n[Visalist](https://visalist.io/?utm_source=reddit&utm_medium=launch&utm_campaign=iwantout) for #TravelTensionFree",
    "is_self": true,
    "link_flair_text": null,
    "comments": [
      {
        "comment_id": "ebfjmdi",
        "author": "seolfor",
        "body": "This is nice! Visas are always such a hassle. Are you planning to add other information like how long a person can stay without a visa or how to obtain a basic tourist one? It is SUCH a hassle because the rules depend both on your country of citizenship and the country you are in at the time. ",
        "score": 47,
        "created_utc": 1544369437.0,
        "created_datetime": "2018-12-09T16:30:37",
        "parent_id": "t3_a4l83b",
        "is_submitter": false
      },
      {
        "comment_id": "ebfpwnh",
        "author": "mgcarley",
        "body": "Timaticweb. By the IATA. Available on many airline websites for free.\n\nOr traveldoc.aero.",
        "score": 18,
        "created_utc": 1544374664.0,
        "created_datetime": "2018-12-09T17:57:44",
        "parent_id": "t3_a4l83b",
        "is_submitter": false
      },
      {
        "comment_id": "ebfiotu",
        "author": "[deleted]",
        "body": "[removed]",
        "score": 34,
        "created_utc": 1544368542.0,
        "created_datetime": "2018-12-09T16:15:42",
        "parent_id": "t3_a4l83b",
        "is_submitter": false
      },
      {
        "comment_id": "ebfrvqx",
        "author": "FearlessTravels",
        "body": "Your information for Belarus is already outdated. ",
        "score": 9,
        "created_utc": 1544375982.0,
        "created_datetime": "2018-12-09T18:19:42",
        "parent_id": "t3_a4l83b",
        "is_submitter": false
      },
      {
        "comment_id": "ebfzcir",
        "author": "[deleted]",
        "body": "[removed]",
        "score": 7,
        "created_utc": 1544381269.0,
        "created_datetime": "2018-12-09T19:47:49",
        "parent_id": "t3_a4l83b",
        "is_submitter": false
      }
    ],
    "keyword_analysis": {
      "found_keywords": {
        "embassy": "visa"
      },
      "found_categories": [
        "visa"
      ],
      "has_relevant_keywords": true,
      "keyword_count": 1
    },
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": true,\n  \"reason\": \"The Reddit post and its title explicitly focus on a web application designed to help users find visa requirements for over 200 countries.  The creator's moti",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 2
  }
]