[
  {
    "subreddit": "AskAcademia",
    "post_id": "1nbuorq",
    "title": "TT R1 Professors, is the job all it's cracked up to be?",
    "author": "Zestyclose_Hawk9014",
    "score": 58,
    "upvote_ratio": 0.91,
    "num_comments": 47,
    "created_utc": 1757353862.0,
    "created_datetime": "2025-09-08T19:51:02",
    "url": "https://www.reddit.com/r/AskAcademia/comments/1nbuorq/tt_r1_professors_is_the_job_all_its_cracked_up_to/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/1nbuorq/tt_r1_professors_is_the_job_all_its_cracked_up_to/",
    "selftext": "Title says it all. For many of us grad students and postdocs, TT professorship is seen as the \"dream job\" where we can finally do the research we want to do in a stable career, but it feels like we never get a complete picture of how it is on the other side.\n\nHow has being a TT professor been in your experience? Do you enjoy the day-to-day as much as you thought you would? Do you miss doing direct lab work? Do you find yourself still being as involved as you want to be, or is most of your time sucked up by meetings, emails and grant writing? Have you experienced anything you didnt expect beforehand? Going back, would you still choose the same path? ",
    "is_self": true,
    "link_flair_text": "STEM",
    "comments": [
      {
        "comment_id": "nd4il2h",
        "author": "ZookeepergameParty47",
        "body": "I’ll just add that not all R1s are the same - there’s a lot of variation. The department/institutional culture matters greatly, and so does your relationships with colleagues.",
        "score": 80,
        "created_utc": 1757354981.0,
        "created_datetime": "2025-09-08T20:09:41",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      },
      {
        "comment_id": "nd4g3tk",
        "author": "Puma_202020",
        "body": "It's a great job, no doubt about it.",
        "score": 38,
        "created_utc": 1757354259.0,
        "created_datetime": "2025-09-08T19:57:39",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      },
      {
        "comment_id": "nd4jzms",
        "author": "Bear-bean",
        "body": "I feel like it has its pros and cons like any job. I’m personally someone who really loves the research but am not in love with teaching. So, in terms of the day to day, I was having more fun as a postdoc spending 8 hours a day on my research and attending seminars (although I won’t complain about the pay bump). I am really grateful for the position though - flexibility to work from anywhere in the summers, few people to answer to as long as you’re doing things and showing face a bit - pretty lovely",
        "score": 20,
        "created_utc": 1757355395.0,
        "created_datetime": "2025-09-08T20:16:35",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      },
      {
        "comment_id": "nd4mvru",
        "author": "esker",
        "body": "Senior faculty / admin here... My day-to-day is almost all meetings and emails, but I get to work on the weekends, so that's a plus! :-) Seriously, it's been a good career where I've had the chance to give back to multiple communities over the years. It's a lot of work, but you really feel like you're making a difference.",
        "score": 18,
        "created_utc": 1757356253.0,
        "created_datetime": "2025-09-08T20:30:53",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      },
      {
        "comment_id": "nd4mva3",
        "author": "ProfPathCambridge",
        "body": "Tenure is stable. TT contracts are fixed term, and a lot of work.",
        "score": 16,
        "created_utc": 1757356249.0,
        "created_datetime": "2025-09-08T20:30:49",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post and comments focus on the experiences of tenure-track (TT) professors at R1 universities.  While this might indirectly relate to the profess",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "1nbeovc",
    "title": "Has anyone actually been to a predatory conference?",
    "author": "CaptainCrash86",
    "score": 154,
    "upvote_ratio": 0.99,
    "num_comments": 32,
    "created_utc": 1757306983.0,
    "created_datetime": "2025-09-08T06:49:43",
    "url": "https://www.reddit.com/r/AskAcademia/comments/1nbeovc/has_anyone_actually_been_to_a_predatory_conference/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/1nbeovc/has_anyone_actually_been_to_a_predatory_conference/",
    "selftext": "Like most academics, I get invites to predatory conference daily. I was wondering if anyone has actually been to one? Are they outright scams, like Fyre Festival for academics, or do they actually happen? ",
    "is_self": true,
    "link_flair_text": "STEM",
    "comments": [
      {
        "comment_id": "nd245b5",
        "author": "egetmzkn",
        "body": "I have a friend who *willingly* participated in one with a colleague. Their university introduced a yearly conference attendance criterion out of nowhere, and they were given until the end of the year (six to seven months) to meet the criterion, or risk having their contract not be renewed. \n\nMy friend had the idea of attending a predatory conference, because all proper congresses close abstract submission almost a year before the conference. \n\nThey were able to submit two abstracts (one for each of them) and get an \"instant acceptance\" as a long-form oral presentation 3 weeks before the conference. It was originally announced that the conference would be held in a smaller city in our country, at the city's one and only conference centre. However, 1 week before the conference, they emailed all speakers (presumably), saying that due to logistical issues, they had to move the conference online.\n\nAfter that, they received another email which basically said something like: \"When it is your time to present, join the online meeting via the link, and when your presentation is over, just leave the meeting. Your certificate of attendance, as well as certificates for your presentations, will be sent to you within an hour.\"\n\nAnd that exact thing actually, really happened. Their presentations were back-to-back from 11.30 to 11.50. They both joined at 11.20, and left as soon as their presentations were over. There were around 20 other people in the meeting with their webcams on, but no one asked a question. All of their certificates were sent by email in around 15 minutes.\n\nThey both were able to use the certificates for the criterion because, on paper, every single thing about the conference was legit.",
        "score": 197,
        "created_utc": 1757325207.0,
        "created_datetime": "2025-09-08T11:53:27",
        "parent_id": "t3_1nbeovc",
        "is_submitter": false
      },
      {
        "comment_id": "nd1bqa0",
        "author": "ImeldasManolos",
        "body": "Omg my friend did this. He flew from\n[REDACTED] (overseas) to Brisbane to listen to talks about basically every single topic, from immunology to agriculture, then they all had posters and then they lined up and all got a prize for their talk and or poster.\n\nPretty shady!",
        "score": 205,
        "created_utc": 1757308523.0,
        "created_datetime": "2025-09-08T07:15:23",
        "parent_id": "t3_1nbeovc",
        "is_submitter": false
      },
      {
        "comment_id": "nd2bldw",
        "author": "Enough-Lab9402",
        "body": "It’s decided. Who’s putting together the Reddit Uber Science conference?",
        "score": 74,
        "created_utc": 1757329232.0,
        "created_datetime": "2025-09-08T13:00:32",
        "parent_id": "t3_1nbeovc",
        "is_submitter": false
      },
      {
        "comment_id": "nd2bdsm",
        "author": "Enough-Lab9402",
        "body": "I love this thread.\n\nThe adult in me worries about the obvious scam and waste of usually taxpayer money.\n\nActual me is just rolling over from this hilarity.",
        "score": 37,
        "created_utc": 1757329129.0,
        "created_datetime": "2025-09-08T12:58:49",
        "parent_id": "t3_1nbeovc",
        "is_submitter": false
      },
      {
        "comment_id": "nd1g7pd",
        "author": "cat-head",
        "body": " There are people who show up for those?! From the way the emails look,  I thought it was a way for shitty academics to get their vacation in Greece refunded by the university without having to do any science.",
        "score": 69,
        "created_utc": 1757310899.0,
        "created_datetime": "2025-09-08T07:54:59",
        "parent_id": "t3_1nbeovc",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post and comments discuss predatory academic conferences, a topic unrelated to immigration to Germany, studying abroad in Germany, or German admi",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "1hmntp4",
    "title": "Completed a Research Paper all by myself, and now the Professor published it on her name",
    "author": "Ok_Willingness8351",
    "score": 1825,
    "upvote_ratio": 0.98,
    "num_comments": 164,
    "created_utc": 1735217815.0,
    "created_datetime": "2024-12-26T13:56:55",
    "url": "https://www.reddit.com/r/AskAcademia/comments/1hmntp4/completed_a_research_paper_all_by_myself_and_now/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/1hmntp4/completed_a_research_paper_all_by_myself_and_now/",
    "selftext": "During my engineering final year, I created a research paper entirely by myself, not even the faculty guide helped me. We submitted the paper to be published in an IEEE conference but it was rejected.\n\nFast-forward to 2023, this professor moved to a different college and started pursuing PhD. She copy/pasted my entire research paper word-to-word, and just added a few topics in intro, and published the paper under her name with two entirely different folks. She even copy/pasted the flow chart from my research manuscript.\n\nNow, I would like to claim the ownership of the work as this is unfair. I do not want to do any legal stuff or take the paper down. Can I ask the editors of the Journal to revise the authors and add me? Can I also ask them to remove the other two authors? What will be the best way to get credibility of my work? I feel devastated, as it was my hard work, and now it is published on an IEEE journal with three names who haven't done anything except adding one or two paragraphs in introduction. Please help, as I have emails where I emailed my manuscript to my college professor back on 2021. She moved to a different college in 2022, and paper was published in 2023 with her PhD guide.",
    "is_self": true,
    "link_flair_text": "STEM",
    "comments": [
      {
        "comment_id": "m3vaydy",
        "author": "Rambo_Baby",
        "body": "Compile all of the proof and email the editor of the IEEE journal. Also email the ethics office at the thief’s institution. Don’t let thieves get away with stealing your work.",
        "score": 1369,
        "created_utc": 1735218079.0,
        "created_datetime": "2024-12-26T14:01:19",
        "parent_id": "t3_1hmntp4",
        "is_submitter": false
      },
      {
        "comment_id": "m3vckpu",
        "author": "deong",
        "body": "> Now, I would like to claim the ownership of the work as this is copyright infringement. I do not want to do any legal stuff or take the paper down. \n\nThere isn’t really a way to just have it switched to your name and nothing else happens. This is major academic misconduct. Your options are (a) do nothing, (b) accuse the professor of plagiarism and provide evidence, etc., or (c) maybe ask the professor to go through whatever process the journal provides to add you as an author. But note that (c) there is unlikely to get you what you want. Generally making a change after publication requires some details and justification, and she’s not going to provide a justification that says \"I plagiarized the whole thing\". She might be willing to falsely say something like \"I inadvertently omitted this person who created Figure 2 from the author list\", in which case you might get to claim some minor coauthorship benefit in future. \n\nThe IEEE journal doesn’t want to be in the middle of any of this. They will never in a million years remove or change authorship unilaterally. They’ll just issue a retraction saying that there were serious concerns over plagiarism, not wade in and try to decide who gets credit themselves. \n\nBut realistically in terms of your options, it’s do nothing or go nuclear. And even if you try option (c), you’re dealing with a caged animal at that point. This is someone who knows what they did, knows their career is on the line, knows that you know what they did, and none of it is public yet. She may just go on offense before you can even decide your next move.",
        "score": 382,
        "created_utc": 1735218904.0,
        "created_datetime": "2024-12-26T14:15:04",
        "parent_id": "t3_1hmntp4",
        "is_submitter": false
      },
      {
        "comment_id": "m3vd80x",
        "author": "Great-Professor8018",
        "body": "I doubt very much that your name could be added by the editors. This may be seen as scientific misconduct in all likelihood. If you can demonstrate it (by showing your older work), the paper would likely be retracted. I don't know about IEEE (I am not an engineer by any stretch of the imagination), but many sciience journals would be reluctant to add a name post publication.\n\nI found this discussion you may find useful:\n\nhttps://academia.stackexchange.com/questions/176606/changing-authors-after-a-paper-is-published",
        "score": 81,
        "created_utc": 1735219227.0,
        "created_datetime": "2024-12-26T14:20:27",
        "parent_id": "t3_1hmntp4",
        "is_submitter": false
      },
      {
        "comment_id": "m3vet4f",
        "author": "apenature",
        "body": "Compile a white paper memorandum with all your evidence. Then send a report with a cover letter/executive summary.\n\nReport it to, via certified/registered mail/email with read receipt:\n\n-The research office of the university the work was done.\n-The research office of the university in which they currently work. \n-Any co-authors. \n-The editors/organisers of the actual entity that published it, i.e. the journal/conference organisers. Ask for formal retraction. \n-The ethics office of the publisher. Ask for formal retraction. \n-if this was laboratory work, send it to the ethics coordinator for the lab. \n\nAfter, get a lawyer and have a cease and desist drafted, serve this professor. To have them stop presenting it. \n\nGood luck! This will not be fun or easy. There is going to be an issue with the institutions pushing back. But if you press and are correct you will get some resolution. This professor is truly fucked if they did what you are alleging they did. \n\nFAFO. There are consequences, and this professor knew them. The academy doesn't need diseased branches. Enough evidence and the publishers and the universities are gonna cut her loose to protect themselves.",
        "score": 67,
        "created_utc": 1735219992.0,
        "created_datetime": "2024-12-26T14:33:12",
        "parent_id": "t3_1hmntp4",
        "is_submitter": false
      },
      {
        "comment_id": "m3vfe2c",
        "author": "throwawaysob1",
        "body": "Follow the advice which other commenters have given about contacting IEEE. File an ethics complaint, or you could contact the conference committee/chair person/secretariat also.\n\nSo this professor is doing a PhD now? Would not want to be in her shoes when it reaches her supervisor - what a stupid thing for them to do!",
        "score": 100,
        "created_utc": 1735220263.0,
        "created_datetime": "2024-12-26T14:37:43",
        "parent_id": "t3_1hmntp4",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": true,\n  \"reason\": \"The post describes academic misconduct, a situation that can significantly impact international students' academic careers and potentially their immigration ",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "1i7r5xu",
    "title": "Trump torpedos NIH",
    "author": "se66ie",
    "score": 1637,
    "upvote_ratio": 0.98,
    "num_comments": 244,
    "created_utc": 1737593609.0,
    "created_datetime": "2025-01-23T01:53:29",
    "url": "https://www.reddit.com/r/AskAcademia/comments/1i7r5xu/trump_torpedos_nih/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/1i7r5xu/trump_torpedos_nih/",
    "selftext": "“Donald Trump’s return to the White House is already having a big impact at the $47.4 billion U.S. National Institutes of Health (NIH), with the new administration imposing a wide range of restrictions, including the abrupt cancellation of meetings such as grant review panels. Officials have also ordered a communications pause, a freeze on hiring, and an indefinite ban on travel.” Science",
    "is_self": true,
    "link_flair_text": "STEM",
    "comments": [
      {
        "comment_id": "m8ncak6",
        "author": "binchcity247",
        "body": "It's just hard to not see this as a push towards privatizing research. like the mark/chan zuck initiatives funding basic/medical science labs now. If the NIH/NSF are defunded, STEM researchers will be forced to find funding or take research positions elsewhere (ie from our oligarchic overlords - I'm being dramatic be chill). any thoughts?",
        "score": 548,
        "created_utc": 1737595880.0,
        "created_datetime": "2025-01-23T02:31:20",
        "parent_id": "t3_1i7r5xu",
        "is_submitter": false
      },
      {
        "comment_id": "m8o2fo9",
        "author": "Pathological_RJ",
        "body": "I was supposed to fly to the NIH to give a seminar next week, just heard from the organizers that’s cancelled. I’ve been looking forward to this for months. It was going to be a great opportunity to network and find potential collaborators",
        "score": 196,
        "created_utc": 1737604775.0,
        "created_datetime": "2025-01-23T04:59:35",
        "parent_id": "t3_1i7r5xu",
        "is_submitter": false
      },
      {
        "comment_id": "m8ocew5",
        "author": "Designer-Post5729",
        "body": "I would say contact your representative, the science congressional committee, AAAS, Aimbe, national academies, and work on making sure everyone in the government knows why supporting research has around the best rates of returns. Perhaps also mention that 40% of people will get cancer during their lifetime, and that includes lawmakers just as much as everyone else...",
        "score": 51,
        "created_utc": 1737608820.0,
        "created_datetime": "2025-01-23T06:07:00",
        "parent_id": "t3_1i7r5xu",
        "is_submitter": false
      },
      {
        "comment_id": "m8rt70y",
        "author": "RedBeans-n-Ricely",
        "body": "My Trump voting colleague today insisted this happens at the start of every administration, as if we haven’t had 2 administration changes in the last 8 years…",
        "score": 23,
        "created_utc": 1737658751.0,
        "created_datetime": "2025-01-23T19:59:11",
        "parent_id": "t3_1i7r5xu",
        "is_submitter": false
      },
      {
        "comment_id": "m8q3vbk",
        "author": "scap3y",
        "body": "Academic funding in the US was already pretty messed up, and this is just going to push researchers off the edge...",
        "score": 17,
        "created_utc": 1737641203.0,
        "created_datetime": "2025-01-23T15:06:43",
        "parent_id": "t3_1i7r5xu",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post and comments focus on the impact of US political changes on the NIH, primarily affecting US-based researchers and grant processes.  There is",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "himc90",
    "title": "In an interview right before receiving the 2013 Nobel prize in physics, Peter Higgs stated that he wouldn't be able to get an academic job today, because he wouldn't be regarded as productive enough.",
    "author": "randomusefulbits",
    "score": 1566,
    "upvote_ratio": 0.99,
    "num_comments": 128,
    "created_utc": 1593519792.0,
    "created_datetime": "2020-06-30T14:23:12",
    "url": "https://www.reddit.com/r/AskAcademia/comments/himc90/in_an_interview_right_before_receiving_the_2013/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/himc90/in_an_interview_right_before_receiving_the_2013/",
    "selftext": "> By the time he retired in 1996, he was uncomfortable with the new academic culture. \"After I retired it was quite a long time before I went back to my department. I thought I was well out of it. It wasn't my way of doing things any more. Today I wouldn't get an academic job. It's as simple as that. I don't think I would be regarded as productive enough.\"\n\nAnother interesting quote from the article is the following:\n\n> He doubts a similar breakthrough could be achieved in today's academic culture, because of the expectations on academics to collaborate and keep churning out papers. He said: \"It's difficult to imagine how I would ever have enough peace and quiet in the present sort of climate to do what I did in 1964.\"\n\nSource (the whole article is pretty interesting): http://theguardian.com/science/2013/dec/06/peter-higgs-boson-academic-system",
    "is_self": true,
    "link_flair_text": "Interdisciplinary",
    "comments": [
      {
        "comment_id": "fwh04za",
        "author": "zen_veteran",
        "body": "Yes, modern science and academia are broken. It is pay to play or heartless, fruitless labor.",
        "score": 391,
        "created_utc": 1593522974.0,
        "created_datetime": "2020-06-30T15:16:14",
        "parent_id": "t3_himc90",
        "is_submitter": false
      },
      {
        "comment_id": "fwhnqat",
        "author": "pinoiboy1",
        "body": "Currently wrapping up my PhD. There is a stark difference in work balance life between students in my lab who are focused on industry and those focused on academia. The ones in academia feel an immense stress to get high level publications (some staying 8+ years to try to push something into nature/science). The competition has become cut throat. This is a trend not just in America but in Europe, Asia and middle east. International graduate students tell me in China go back 20 years, having any ACS publication from american university is enough to get professorship. Now you better come stacked with publications and at least one nature/science. American universities are even more competitive. How many publications, how many conferences, how many patents...",
        "score": 74,
        "created_utc": 1593535113.0,
        "created_datetime": "2020-06-30T18:38:33",
        "parent_id": "t3_himc90",
        "is_submitter": false
      },
      {
        "comment_id": "fwh0v7j",
        "author": "PassTheWinePlease",
        "body": "This and the combination of the inevitable pandemic effects on the job market make me really second guess if academia is a “good” career option.",
        "score": 143,
        "created_utc": 1593523424.0,
        "created_datetime": "2020-06-30T15:23:44",
        "parent_id": "t3_himc90",
        "is_submitter": false
      },
      {
        "comment_id": "fwhho5v",
        "author": "politicsasusual101",
        "body": "“It's difficult to imagine how I would ever have enough peace and quiet in the present sort of climate to do what I did in 1964.\"\n\nExactly! Sometimes if you just have some actual peace and quiet to work on a problem or let it take you into unexpected directions, you can produce amazing discoveries. \n\nInstead, it always feels like working *until* a paper materialises then move onto the next thing that will get a paper etc.",
        "score": 70,
        "created_utc": 1593532217.0,
        "created_datetime": "2020-06-30T17:50:17",
        "parent_id": "t3_himc90",
        "is_submitter": false
      },
      {
        "comment_id": "fwhp8d4",
        "author": "notnotaginger",
        "body": "It’s ironic to me that research has shown that productivity isn’t all it’s cracked up to be yet here we are.",
        "score": 64,
        "created_utc": 1593535824.0,
        "created_datetime": "2020-06-30T18:50:24",
        "parent_id": "t3_himc90",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post and comments discuss the changing nature of academic research and its impact on career prospects, particularly in the context of productivit",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "1ghs67e",
    "title": "What Is Your Opinion On Students Using Echowriting To Make ChatGPT Sound Like They Wrote It?\n",
    "author": "Possible_Stomach_494",
    "score": 1514,
    "upvote_ratio": 0.96,
    "num_comments": 155,
    "created_utc": 1730537186.0,
    "created_datetime": "2024-11-02T09:46:26",
    "url": "https://www.reddit.com/r/AskAcademia/comments/1ghs67e/what_is_your_opinion_on_students_using/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/1ghs67e/what_is_your_opinion_on_students_using/",
    "selftext": "My post did well in the gradschool sub so i'm posting here as well.\n\n**I don’t condone this type of thing. It’s unfair on students who actually put effort into their work. I get that ChatGPT can be used as a helpful tool, but not like this.**\n\nIf you're in uni right now or you're a lecturer, you’ll know about the whole ChatGPT echowriting issue. I didn’t actually know what this meant until a few days ago.\n\nFirst we had the dilemma of ChatGPT and students using it to cheat.\n\nThen came AI detectors and the penalties for those who got caught using ChatGPT.\n\nNow 1000s of students are using echowriting prompts on ChatGPT to trick teachers and AI detectors into thinking they actually wrote what ChatGPT generated themselves.\n\nSo basically now we’re back to square 1 again.\n\nWhat are your thoughts on this and how do you think schools are going to handle this?",
    "is_self": true,
    "link_flair_text": "Administrative",
    "comments": [
      {
        "comment_id": "luzwfpi",
        "author": "ProfessorOnEdge",
        "body": "I am fortunate enough to be able to teach small classes. \n\nAs such I tend to make students discuss and answer questions about the papers they've written. \n\nIf they can explain it coherently in their own words orally, then I don't really care who wrote the paper, since they have demonstrated understanding.\n\nIf they can only repeat a few catch phrases and cannot actually explain the topic of their paper then they've been caught... And instead of threatening disciplinary action, I offer them the chance to rewrite it, or take a zero for the assignment.",
        "score": 476,
        "created_utc": 1730542744.0,
        "created_datetime": "2024-11-02T11:19:04",
        "parent_id": "t3_1ghs67e",
        "is_submitter": false
      },
      {
        "comment_id": "luzpbx8",
        "author": "incomparability",
        "body": "What is echo writing?",
        "score": 86,
        "created_utc": 1730537795.0,
        "created_datetime": "2024-11-02T09:56:35",
        "parent_id": "t3_1ghs67e",
        "is_submitter": false
      },
      {
        "comment_id": "luzx1cd",
        "author": "Beterraba_ansiosa",
        "body": "As some have already mentioned it, the solution here is update evaluation methods. This thing is not going back to the bottle no matter how much professors complain about it.  \nAlso, echo-writing is nothing super new. Smarter students have been doing it since GPT came out, it just did not have a fancy name.  Also a bit of an unpopular opinion: You yourself mention you do not fully understand what it means. Maybe take the time to understand it better could help you find a solution for your specific subject.",
        "score": 92,
        "created_utc": 1730543140.0,
        "created_datetime": "2024-11-02T11:25:40",
        "parent_id": "t3_1ghs67e",
        "is_submitter": false
      },
      {
        "comment_id": "luzslev",
        "author": "vjx99",
        "body": "AI detectors are usually bullshit ([Source](https://mitsloanedtech.mit.edu/ai/teach/ai-detectors-dont-work/)) and discriminate against non-native english speakers ([Source](https://hai.stanford.edu/news/ai-detectors-biased-against-non-native-english-writers)). Please don't penalize students just based off what some proprietary algorithm is telling you.",
        "score": 244,
        "created_utc": 1730540133.0,
        "created_datetime": "2024-11-02T10:35:33",
        "parent_id": "t3_1ghs67e",
        "is_submitter": false
      },
      {
        "comment_id": "luzrgwq",
        "author": "incomparability",
        "body": "Echowriting is academically dishonest and should be treated as thus. \n\nHowever, I don’t know how to catch it. \n\nNevertheless, no matter how similar to a human the AI sounds, the logical content of an LLM output is still often bogus. You can catch this by simply reading the paper. More precisely, you catch a genuine lack of understanding no matter how the paper was written. While this does not mean you have a case for academic dishonesty, you do have a case for failing.",
        "score": 105,
        "created_utc": 1730539328.0,
        "created_datetime": "2024-11-02T10:22:08",
        "parent_id": "t3_1ghs67e",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post and comments discuss academic integrity and the use of AI writing tools in higher education.  While this is relevant to the student experien",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "1h7uzcw",
    "title": "I was almost kidnapped during a research trip. Should I tell my PI?",
    "author": "Fantastic_Row_5000",
    "score": 1443,
    "upvote_ratio": 0.96,
    "num_comments": 203,
    "created_utc": 1733465838.0,
    "created_datetime": "2024-12-06T07:17:18",
    "url": "https://www.reddit.com/r/AskAcademia/comments/1h7uzcw/i_was_almost_kidnapped_during_a_research_trip/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/1h7uzcw/i_was_almost_kidnapped_during_a_research_trip/",
    "selftext": "Hi all. New grad student here who doesn’t yet understand what needs to be shared with the PI and what is too much information. I was almost kidnapped by a driver during my commute to a research facility to characterize samples, but was saved by the police. It didn’t affect my performance because I finished the trip, so I don’t know if it’s unprofessional for me to send my PI a message telling them about this event. \n\nIf you were a PI, would you like your grad student to tell you about this? \n\nEdit: Your responses are making me emotional . Thank you all for the feedback. \n\nSecond edit: I don’t think this is likely to happen to anyone else here because this is in a big metropolitan area in the US, so Uber rides are super common and kidnapping is not a local issue. \n\nThird edit: I told my PI, who was in absolute shock and was super supportive. They also reassured me that I am not at fault and encouraged me to seek counseling. I think I’m still not thinking rationally because it took so long for me to even realize that my life was genuinely in danger. \nAll I was thinking of at the time was that I need to make it to the research facility on time. \n\nToday I called Uber and reported the incident. The good news is that they have the ENTIRE recording of the conversation between the driver and I in their database so they will listen to it and decide whether to ban the driver from Uber. The bad news is, from a safety standpoint, the driver also works with Lyft (I saw the sticker on his car) so he would continue to endanger people, unless Uber decides that it was dangerous enough that they report him to law enforcement or Lyft as well. Obviously I had reported it to multiple levels of the law enforcement in real time as well. \n\nUber also gave me a refund because I was sure to emphasize the urgency and magnitude of what happened, as well as cite the exact state law violations that the driver committed. I realize now that the combination of having satellite service to call 911 in an area without reception (serendipitously, as I recently got the new iPhone) and the loud notification from Uber that I should call 911 immediately potentially saved my life. ",
    "is_self": true,
    "link_flair_text": "Interpersonal Issues",
    "comments": [
      {
        "comment_id": "m0o5856",
        "author": "whereismydragon",
        "body": "Let me ask a question in return: what *logical* reasons can you come up with, if any, to *not* speak to your PI about this?",
        "score": 952,
        "created_utc": 1733466334.0,
        "created_datetime": "2024-12-06T07:25:34",
        "parent_id": "t3_1h7uzcw",
        "is_submitter": false
      },
      {
        "comment_id": "m0o83v8",
        "author": "batman613",
        "body": "I cannot imagine more important information for the PI. This should change how (if) future graduate students and researchers go to the facility, create new security protocols to keep people safe, and also ensure that your PI doesn't find out by another means and wonder why you said nothing.",
        "score": 375,
        "created_utc": 1733467982.0,
        "created_datetime": "2024-12-06T07:53:02",
        "parent_id": "t3_1h7uzcw",
        "is_submitter": false
      },
      {
        "comment_id": "m0o4vwl",
        "author": "matthewsmugmanager",
        "body": "Absofuckinglutely.",
        "score": 869,
        "created_utc": 1733466145.0,
        "created_datetime": "2024-12-06T07:22:25",
        "parent_id": "t3_1h7uzcw",
        "is_submitter": false
      },
      {
        "comment_id": "m0o54ae",
        "author": "CharmingZucchini5126",
        "body": "Yes! Please tell them. The university might want to know too. They keep track of these things to see if there’s repeating problems",
        "score": 286,
        "created_utc": 1733466275.0,
        "created_datetime": "2024-12-06T07:24:35",
        "parent_id": "t3_1h7uzcw",
        "is_submitter": false
      },
      {
        "comment_id": "m0o78qh",
        "author": "Several-Gene8214",
        "body": "It goes beyond the PI. Because you were on a business trip and the police were involved, even the university has to be informed. At our university, students can borrow a department's car to go to sampling areas.",
        "score": 98,
        "created_utc": 1733467485.0,
        "created_datetime": "2024-12-06T07:44:45",
        "parent_id": "t3_1h7uzcw",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": true,\n  \"reason\": \"The post and comments directly address safety concerns for a graduate student conducting research in an unspecified location.  While not explicitly about imm",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "s1pgtu",
    "title": "I defended my PhD today!",
    "author": "cookie_monster_10",
    "score": 1412,
    "upvote_ratio": 0.98,
    "num_comments": 113,
    "created_utc": 1641939862.0,
    "created_datetime": "2022-01-11T23:24:22",
    "url": "https://www.reddit.com/r/AskAcademia/comments/s1pgtu/i_defended_my_phd_today/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/s1pgtu/i_defended_my_phd_today/",
    "selftext": "I did it. I passed! I’m so happy 😭\n\nEdit: WOW! Thank you all so much for your kind words and congratulations! I tried to thank each and every person commenting but I didn’t expect this post to get so much attention and it got hard to keep up😅 It’s definitely making this achievement extra special. Also, thank you for the awards!",
    "is_self": true,
    "link_flair_text": "STEM",
    "comments": [
      {
        "comment_id": "hs9vzlq",
        "author": "dbrodbeck",
        "body": "Nice work Doc!",
        "score": 92,
        "created_utc": 1641942562.0,
        "created_datetime": "2022-01-12T00:09:22",
        "parent_id": "t3_s1pgtu",
        "is_submitter": false
      },
      {
        "comment_id": "hs9z1nh",
        "author": "Zelamir",
        "body": "Congratulations Dr. C. Monster the 10th!!!",
        "score": 81,
        "created_utc": 1641943816.0,
        "created_datetime": "2022-01-12T00:30:16",
        "parent_id": "t3_s1pgtu",
        "is_submitter": false
      },
      {
        "comment_id": "hs9xk7g",
        "author": "[deleted]",
        "body": "Congratulations, doctor!",
        "score": 28,
        "created_utc": 1641943204.0,
        "created_datetime": "2022-01-12T00:20:04",
        "parent_id": "t3_s1pgtu",
        "is_submitter": false
      },
      {
        "comment_id": "hs9zfjj",
        "author": "priestess-time",
        "body": "Dr. cookie\\_monster\\_10!  \nCongratulations!",
        "score": 22,
        "created_utc": 1641943976.0,
        "created_datetime": "2022-01-12T00:32:56",
        "parent_id": "t3_s1pgtu",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": true,\n  \"reason\": \"The post celebrates the completion of a PhD, which is directly relevant to studying abroad in Germany.  The PhD process involves significant administrative a",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "gjiz1j",
    "title": "If any professor is reading this: please do not praise students keeping their presentations much longer than you said it should be because it covers more. It is unfair and an obvious sign of obliviousness. It is nonsense.",
    "author": "matkapriza",
    "score": 1315,
    "upvote_ratio": 0.96,
    "num_comments": 81,
    "created_utc": 1589448267.0,
    "created_datetime": "2020-05-14T11:24:27",
    "url": "https://www.reddit.com/r/AskAcademia/comments/gjiz1j/if_any_professor_is_reading_this_please_do_not/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/gjiz1j/if_any_professor_is_reading_this_please_do_not/",
    "selftext": "Please. If you tell your students to keep their presentations at a certain length, do not praise the ones who go above the set time limit by half an hour and praise their work for its depth. This has happened to me second time now. My professor asks me to cover one of the most controversial and comprehensive subjects in social sciences in 10 minutes and rolls their eyes for it not having elaborated enough in certain aspects while praising the 40-minute-though-supposed-to-be-10-minute presentation of my classmate for covering more on the same subject.\n\nIf there are any professors reading this; please don't do this. Some students put a lot of work into making the damn presentation as concise as possible and literally rehearse a few times so that they do not go over the time limit. Covering more by going waaaay above the limit you yourself set is not something to be encouraged. Nor is it fair.",
    "is_self": true,
    "link_flair_text": "Interpersonal Issues",
    "comments": [
      {
        "comment_id": "fql8c55",
        "author": "foibleShmoible",
        "body": "It sounds like you just have a crappy professor, because most would be very strict on times; in fact (as you allude to) keeping within time and making a concise while still informative presentation is a skill within itself, and many academics I know would mark down someone for going over their time.",
        "score": 425,
        "created_utc": 1589449823.0,
        "created_datetime": "2020-05-14T11:50:23",
        "parent_id": "t3_gjiz1j",
        "is_submitter": false
      },
      {
        "comment_id": "fqlb348",
        "author": "Flubb",
        "body": "I stop marking anyone after time + 10%. If you haven't concluded by then, tough.",
        "score": 120,
        "created_utc": 1589452559.0,
        "created_datetime": "2020-05-14T12:35:59",
        "parent_id": "t3_gjiz1j",
        "is_submitter": false
      },
      {
        "comment_id": "fqlb8fs",
        "author": "the_makalele_roll",
        "body": "Absolutely, I tell my students the time length and ask they adhere to it strictly. Due to our class sizes, we may have multiple presentations so it’s not fair to others. Also, for assessment purposes the comparability is compromised. Overrunning on presentations at conferences really annoys me. I was on a panel and a speaker over ran so badly that we all had to reduce our own talks. It was very frustrating!",
        "score": 33,
        "created_utc": 1589452704.0,
        "created_datetime": "2020-05-14T12:38:24",
        "parent_id": "t3_gjiz1j",
        "is_submitter": false
      },
      {
        "comment_id": "fqlldif",
        "author": "Marky_Marky_Mark",
        "body": "I'm pretty strict on time, to the point where I'll cut off the presentation if it goes over the alloted time (typically, I'll also give them a warning when they're halfway through their time and another when a minute is left). Getting your point accross concisely is a valuable skill and important to master in a business environment. \nIn a similar vein, I put a max word/page count on assignments instead of a minimum. Students often seem surprised at that.",
        "score": 17,
        "created_utc": 1589460984.0,
        "created_datetime": "2020-05-14T14:56:24",
        "parent_id": "t3_gjiz1j",
        "is_submitter": false
      },
      {
        "comment_id": "fqm13jt",
        "author": "[deleted]",
        "body": "I’ve never ever met a professor that did this. There’s a reason for limits and it’s annoying and shows a lack of respect for directions and for others’ time if a student goes above them especially in something like a presentation. This is coming from someone who in high school once made a 15 minute presentation on the French colonization of Algeria when it supposed to be 5 minutes.",
        "score": 17,
        "created_utc": 1589469676.0,
        "created_datetime": "2020-05-14T17:21:16",
        "parent_id": "t3_gjiz1j",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": true,\n  \"reason\": \"The post and comments directly relate to the university experience and expectations of students in a German university setting.  The discussion centers aroun",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "1jn17x8",
    "title": "Are you ashamed that Harvard, Columbia, and other institutions are kowtowing and in acquiescence towards this administration?",
    "author": "[deleted]",
    "score": 1282,
    "upvote_ratio": 0.92,
    "num_comments": 317,
    "created_utc": 1743296815.0,
    "created_datetime": "2025-03-30T03:06:55",
    "url": "https://www.reddit.com/r/AskAcademia/comments/1jn17x8/are_you_ashamed_that_harvard_columbia_and_other/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/1jn17x8/are_you_ashamed_that_harvard_columbia_and_other/",
    "selftext": "Title",
    "is_self": true,
    "link_flair_text": "Meta",
    "comments": [
      {
        "comment_id": "mkg8a4w",
        "author": "Puma_202020",
        "body": "Yes.",
        "score": 624,
        "created_utc": 1743297899.0,
        "created_datetime": "2025-03-30T03:24:59",
        "parent_id": "t3_1jn17x8",
        "is_submitter": false
      },
      {
        "comment_id": "mkgsimc",
        "author": "macroeconprod",
        "body": "No, this was expected from the ivy league faculty. You can always tell a Milford man.",
        "score": 38,
        "created_utc": 1743305958.0,
        "created_datetime": "2025-03-30T05:39:18",
        "parent_id": "t3_1jn17x8",
        "is_submitter": false
      },
      {
        "comment_id": "mkgadk5",
        "author": "[deleted]",
        "body": "busy coherent sophisticated nine grandiose engine airport yam fly plucky\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
        "score": 128,
        "created_utc": 1743298684.0,
        "created_datetime": "2025-03-30T03:38:04",
        "parent_id": "t3_1jn17x8",
        "is_submitter": false
      },
      {
        "comment_id": "mkgb0sn",
        "author": "restricteddata",
        "body": "I think it is _shameful_ that university administrators, especially at universities that have the largest reputations and also the largest endowments, have shown themselves to be so utterly morally bankrupt, so utterly incapable of actually prioritizing their students, faculty, and intellectual missions. It is not surprising in the slightest, however; it was made very clear last summer that their fear of bad publicity and their fear of their worst-but-richest alumni could be used to make them do anything. They folded last summer, and that made them obvious victims for further abuse now. They'll fold again, and — guess what — it's not going to save them. They'll lose the money _and_ they'll lose the respect. Their administrators are both idiots and cowards. \n\nColumbia has an endowment of $15 billion. Harvard has an endowment $53 billion. Yes, losing hundreds of millions in grant monies would definitely hurt in the short term. But these are not cash-strapped places. We are talking about a few percentage points of their cash hoards. I am aware that endowments are not bank accounts, but the general point that these universities have enough in their investments to coast for quite some time is still true.\n\nLet's imagine a world in which they said, stuff it, we're sticking to our guns. What happens then? Yes, there's a loss of revenue. Belt tightening. Hiring freezes. But they'd have the best damned excuse to raise tuition, solicit alumni for donations, freeze salaries, and so on. They'd be immune to the normal griping — they'd be doing a heroic sacrifice. Any administrator who got canned for standing up to this rot would be hailed as a hero and have rich opportunities in their future (to say nothing of whatever golden parachute they'd be getting). \n\nInstead they're going to end up probably needing to do all that stuff anyway, but after showing that they stand for nothing. I am thoroughly unimpressed. But, again, not surprised. These people have no sense of the world they are living in, and somehow never see it to ask the experts who work for them for input on such matters, either.",
        "score": 150,
        "created_utc": 1743298927.0,
        "created_datetime": "2025-03-30T03:42:07",
        "parent_id": "t3_1jn17x8",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post and comments discuss the perceived political alignment of Ivy League universities, a topic unrelated to immigration, studying abroad in Germ",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "negpkx",
    "title": "Do students realize how hard it is to become a professor at a University?",
    "author": "East-Pomegranate-134",
    "score": 1279,
    "upvote_ratio": 0.99,
    "num_comments": 255,
    "created_utc": 1621259231.0,
    "created_datetime": "2021-05-17T15:47:11",
    "url": "https://www.reddit.com/r/AskAcademia/comments/negpkx/do_students_realize_how_hard_it_is_to_become_a/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/negpkx/do_students_realize_how_hard_it_is_to_become_a/",
    "selftext": "I find a lot of students who get into top universities such as UMich, Harvard, UPenn (Ivy’s and public Ivy’s)and other top schools are naive with how hard it is to actually get a job as a professor at any university on top of that, the “best” universities. \n\nI remember talking to a junior who was at Columbia and her cousin got a job at University of Cincinnati as an Assistant Professor at age 29. Basically trashed talk that they were not good enough to be a professor at Harvard or something. \nNow I myself, graduated from one of the top 5 schools in the world and I’m teaching my first job at a school ranking about 100-150 In the world. Some may find it off, but honestly there was only 1 job available for my field for 3 years now. \n\nWhat are you experiences? \n\nDo you think students who go to top colleges have unrealistic expectations about where their first job might land?  \n\nMany who go to top unis like Harvard think their options to teach mean only other Ivy leagues or top public ivys, what is this snobby attitude?",
    "is_self": true,
    "link_flair_text": "Interpersonal Issues",
    "comments": [
      {
        "comment_id": "gygk0qn",
        "author": "[deleted]",
        "body": "Sounds like my parents. I did undergrad and grad at my state's flagship R1 public university, and did a postdoc at an Ivy. They don't think either of my prof jobs (small midwestern R2 followed by large southern R1 but isn't a historically big name school) are impressive, and keep asking why i can't come back home and work at my alma mater.",
        "score": 150,
        "created_utc": 1621267749.0,
        "created_datetime": "2021-05-17T18:09:09",
        "parent_id": "t3_negpkx",
        "is_submitter": false
      },
      {
        "comment_id": "gygafa9",
        "author": "downsideleft",
        "body": "Even PhD candidates don't understand. I spend time on both the generic and my filed specific graduate student subreddits, and they constantly say things like \"it doesn't matter where your degree is from\" and then down vote me when I point out that most search committees won't even read the CV unless it's from a top 50 school. There's literally studies that show that where your degree is from is the most important factor in getting a faculty job. I get that they want to keep their hopes alive, but it's painful to see prospective PhDs getting terrible advice from PhD candidates who have no clue what the job search is like.\n\nUndergrads, though... Who cares about their perception? They have no clue what it even means to be an academic. I mean, I barely understand what it means to be an academic in the humanities because it's so different than stem, and I'm sure I don't know what it's like to be a humanities professor at an ivy league. I mean, my engineering research is pretty simple: identify something another scientists wishes they could do, design a thing to do it, publish and repeat. I can't imagine trying to contribute some novel idea about 500 year old philosophy that's been studied extensively.",
        "score": 329,
        "created_utc": 1621263739.0,
        "created_datetime": "2021-05-17T17:02:19",
        "parent_id": "t3_negpkx",
        "is_submitter": false
      },
      {
        "comment_id": "gyg2tvw",
        "author": "thegreenaquarium",
        "body": "I find most students don't think about how hard it is to become a professor because they don't care, which is how it should be. I also think it's healthier for academics to not care so much about what juniors at Columbia think about their teaching job at a school ranking 100-150 in the world. It's kinda like riling against Gen Z for shaming skinny jeans. They're carefree and they fundamentally don't understand your life - and, you know, you probably had the opportunity to be naively arrogant as a young person, and they deserve that opportunity too.",
        "score": 354,
        "created_utc": 1621260423.0,
        "created_datetime": "2021-05-17T16:07:03",
        "parent_id": "t3_negpkx",
        "is_submitter": false
      },
      {
        "comment_id": "gygh5fe",
        "author": "rick2882",
        "body": "You would think they would realize it in grad school when they notice that all of their professors at their relatively low-ranked university received their PhD and/or postdoc experience from Yale or Harvard or similar university...and yet...",
        "score": 137,
        "created_utc": 1621266550.0,
        "created_datetime": "2021-05-17T17:49:10",
        "parent_id": "t3_negpkx",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post and comments focus on the difficulty of obtaining a professorship in US universities.  This topic is not directly related to immigration pro",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "1ff77ws",
    "title": "Students are cheating massively. I now have to restructure the syllabus. ",
    "author": "Loose_Artichoke5012",
    "score": 1210,
    "upvote_ratio": 0.97,
    "num_comments": 344,
    "created_utc": 1726159612.0,
    "created_datetime": "2024-09-12T18:46:52",
    "url": "https://www.reddit.com/r/AskAcademia/comments/1ff77ws/students_are_cheating_massively_i_now_have_to/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/1ff77ws/students_are_cheating_massively_i_now_have_to/",
    "selftext": "I’m trying to create assignments and structure the class so that they don’t really rely on AI. The take-home portion is that students get together in groups of three randomly selected by me and they have to answer questions on a case study. After I receive the result, I noticed that more than half of them had similar answers. I now have to confront them saying that we can’t do this anymore and now we have to, study out and replace it with something else. Some replacements I’m thinking of are doing the case studies in class, replace the case studies with two exams for the semester in class, or a debate structure. What other suggestions does anyone have to help mitigate the use of AI programs?",
    "is_self": true,
    "link_flair_text": "Cheating/Academic Dishonesty - post in /r/college, not here",
    "comments": [
      {
        "comment_id": "lmskwon",
        "author": "JHT230",
        "body": "The most foolproof would be to just base the grade off of exams or even exams + attendance with no mandatory take-home assignments.\n\nIf you wanted to be sneaky, you could allow the use of completed homeworks to take to exams as a cheat sheet. Students who actually worked on the assignment should find it quite helpful while those who used AI will just have garbage.",
        "score": 911,
        "created_utc": 1726160917.0,
        "created_datetime": "2024-09-12T19:08:37",
        "parent_id": "t3_1ff77ws",
        "is_submitter": false
      },
      {
        "comment_id": "lmsvy3l",
        "author": "dmlane",
        "body": "I don’t know if this would be of any value, but I’ve toyed with the idea of giving students the AI output and asking them to evaluate and improve it.",
        "score": 217,
        "created_utc": 1726164353.0,
        "created_datetime": "2024-09-12T20:05:53",
        "parent_id": "t3_1ff77ws",
        "is_submitter": false
      },
      {
        "comment_id": "lmsxjhb",
        "author": "Meister1888",
        "body": "Frequent class quizzes, class case studies, class exams. So take-home work is reading and preparing for class materials.\n\nYou need to change the \"tested\" materials every semester. Student groups compile exams over time.",
        "score": 102,
        "created_utc": 1726164866.0,
        "created_datetime": "2024-09-12T20:14:26",
        "parent_id": "t3_1ff77ws",
        "is_submitter": false
      },
      {
        "comment_id": "lmsyo1j",
        "author": "pupperonipizzapie",
        "body": "AFAIK AI still has trouble creating real citations - it will simply make a source up. You can ask that each assignment include at least 1 citation & include the link to the paper. It does create a bit of extra work but it should not be difficult for a TA to just click through and do a 5-second check to see that it's a real, relevant article.",
        "score": 41,
        "created_utc": 1726165226.0,
        "created_datetime": "2024-09-12T20:20:26",
        "parent_id": "t3_1ff77ws",
        "is_submitter": false
      },
      {
        "comment_id": "lmsoh4f",
        "author": "Anthroman78",
        "body": "I would just do the case studies in class.",
        "score": 21,
        "created_utc": 1726162023.0,
        "created_datetime": "2024-09-12T19:27:03",
        "parent_id": "t3_1ff77ws",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": true,\n  \"reason\": \"The post and comments directly address challenges in designing academic assessments to prevent cheating, a common concern for universities globally, includin",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "1kbcdy5",
    "title": "I'm a public school teacher- University of Kentucky, College of Medicine plagiarized my work and won’t respond",
    "author": "Agreeable_Mobile_235",
    "score": 1099,
    "upvote_ratio": 0.97,
    "num_comments": 147,
    "created_utc": 1746005862.0,
    "created_datetime": "2025-04-30T11:37:42",
    "url": "https://www.reddit.com/r/AskAcademia/comments/1kbcdy5/im_a_public_school_teacher_university_of_kentucky/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/1kbcdy5/im_a_public_school_teacher_university_of_kentucky/",
    "selftext": "As a public school teacher in Kentucky I helped create a project that brought University of Kentucky (UK) professional students into our K–12 classrooms to inspire kids. My husband and I coined the name, chose the color scheme, designed the lesson plan process, and even took the original photos. This wasn’t a one-off. We worked on this idea for years before ever moving to Kentucky.\n\nI coordinated between UK and the school district and helped students design accessible lesson plans for younger learners. Now, UK medical students and a staff member published an article claiming credit for this initiative — using our words, our pictures, and our concept, **without giving us any recognition.** They volunteered at our events but didn’t create the idea or the program. Even others who did contribute intellectually were left out.\n\n**UK’s College of Medicine and legal team have ignored every attempt we’ve made to correct this.** I feel betrayed. As a teacher, I always tell my students to value **honesty** and give credit where it’s due. Institutions should be held to the same standard.\n\n**Plagiarism is wrong.** Silence is complicity. Everyone deserves credit for their work.\n\nWhat can be done about this?\n\n  \nEDIT: \n\nA few clarifications:\n\n1. Posting here was a last resort. We actually reached out to the 3 students and the staff member weeks BEFORE this poster came out, asking specifically about continuing with the publication that we (my husband and I) had initiated...they didn't even respond to us.\n\n2. This was a poster in a research conference at University of Kentucky, College of Medicine. We had larger publications in talks and if it wasn't for me calling them out on social media, I have reason to believe they may have taken this further, considering that they and everyone we have reached out to within UK has ignored us.",
    "is_self": true,
    "link_flair_text": "Professional Misconduct in Research",
    "comments": [
      {
        "comment_id": "mptcbwv",
        "author": "Extension_Break_1202",
        "body": "If this is a published article in an academic conference or academic journal, thus framed as “research”, you could contact the UK office of research integrity and take up your complaint with them.",
        "score": 600,
        "created_utc": 1746007639.0,
        "created_datetime": "2025-04-30T12:07:19",
        "parent_id": "t3_1kbcdy5",
        "is_submitter": false
      },
      {
        "comment_id": "mptp8hx",
        "author": "SherbetOutside1850",
        "body": "I am a UK faculty, though I am not in the College of Medicine.\n\nFirst, you should get a lawyer if you don't have one, just to get some guidance on how to preserve and put together your own evidence.\n\n\\-All of the original work you did, preserve the original files with time stamps on every version.  \n\\-Any invitations or overtures you made to the Medical School to ask them to participate  \n\\-Any additional communication with Medical School staff regarding scheduling, etc.  \n\\-Any communication with your superiors or staff (VP, secretaries, whatever) about this event and your role in it.  \n\\-Any communication between yourself and your husband regarding the project\n\nMake sure everything has a time stamp of some kind.\n\nIf you have all that together, then I'd go to the Office of Research Integrity, which is housed in the VP for Research office. Contact information is here: 859-257-9428 ([rs\\_ORI@uky.edu](mailto:rs_ORI@uky.edu)).\n\nThe other thing to do is to contact the journal and tell them you have solid evidence that these people misrepresented the research. They will listen to you. If you are convincing, they will act on it.\n\nFinally, I'd just say this: UK has an army of lawyers that shield them from any consequences, whether they are at fault or not. UK legal is there to protect UK, not to be neutral arbiters in a dispute with UK. Stop calling them. They won't care. \n\nBut one thing Capilouto hates is bad publicity. For that reason, you might find some satisfaction going to Linda Blackford, who covers all things education for the *Herald Leader* ([lblackford@herald-leader.com](mailto:lblackford@herald-leader.com), 859-488-1571). I think she would be interested in your story. If she thinks it has real legs, she'll publish it.\n\nThat said, be very careful that you can *prove* what you are saying. That is, you have time stamped files and images showing these ideas, images, text, and so forth originated with you, you have correspondence with your VP about getting UK involved, you have emails reaching out to them about the relationship, etc.\n\nFinally, as a quick and dirty piece of advice: next time you come up with a fabulous idea, print everything out, write up a description, put it in an envelope and mail it to yourself as a certified letter but *do not open it*. Only then contact people about your idea. Your envelope can be unsealed in court or by your lawyer and that provides support for your timeline that some idea or creative endeavor originated with you.\n\nGood luck.",
        "score": 335,
        "created_utc": 1746013958.0,
        "created_datetime": "2025-04-30T13:52:38",
        "parent_id": "t3_1kbcdy5",
        "is_submitter": false
      },
      {
        "comment_id": "mptemdi",
        "author": "No-Tie-710",
        "body": "Contact the journal editor - they have the power to retract. Also contact the institutional review board which supervises research ethics.",
        "score": 194,
        "created_utc": 1746008942.0,
        "created_datetime": "2025-04-30T12:29:02",
        "parent_id": "t3_1kbcdy5",
        "is_submitter": false
      },
      {
        "comment_id": "mptauz9",
        "author": "lipflip",
        "body": "That sound so wrong. How can anyone just silently copy your concept and publish about it? Wouldn't it be just easier and a win-win to involve you in this?\n\nWhere was it published? Like on their blog (look what we have done to get more school students into science) or as a scientific article (a novel university outreach concept  to bring more students into science, journal/conference on science attractiveness)?\n\nIf it's the former, i would find it annoying but ignore it. It's nasty but doesn't matter. If it is the later, you can also contact the journal or publisher of the journal (after giving the university enough time to react, say two weeks). Be sure to document your prior work so that you can prove that it's your concept.",
        "score": 65,
        "created_utc": 1746006771.0,
        "created_datetime": "2025-04-30T11:52:51",
        "parent_id": "t3_1kbcdy5",
        "is_submitter": false
      },
      {
        "comment_id": "mptjj7m",
        "author": "nicepelican",
        "body": "Based on your other post this isn’t an article but a poster. Posters tend to be taken less seriously than an article (partly because an article is permanently available online whereas a poster is often a one-off presentation). I recognize this is a very frustrating experience and you deserve an apology but if this is just a poster at a random conference in the long run they won’t gain too much benefit from it, and there isn’t anything to retract.\n\nHave you contacted the faculty involved? Faculty are usually pretty nervous about plagiarism so they will likely clamp down on the students presenting this work again.",
        "score": 52,
        "created_utc": 1746011437.0,
        "created_datetime": "2025-04-30T13:10:37",
        "parent_id": "t3_1kbcdy5",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post and comments describe a case of alleged plagiarism involving a US university and a public school teacher.  This is an intellectual property ",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "12v0p41",
    "title": "IDK who needs to hear this, but it is 100% okay to ignore all emails, messages, and texts over the weekend",
    "author": "[deleted]",
    "score": 1026,
    "upvote_ratio": 0.97,
    "num_comments": 65,
    "created_utc": 1682156067.0,
    "created_datetime": "2023-04-22T11:34:27",
    "url": "https://www.reddit.com/r/AskAcademia/comments/12v0p41/idk_who_needs_to_hear_this_but_it_is_100_okay_to/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/12v0p41/idk_who_needs_to_hear_this_but_it_is_100_okay_to/",
    "selftext": "I see post after post about stressed-out postdocs/grad students with advisors that expect them to respond to messages/emails/texts over the weekend.\n\nYo, like, ignore them. It's the WEEKEND. If they ask why you're ignoring them, tell them it's the weekend and you have personal plans. It doesn't matter if those plans include eating a whole tray of pot brownies wearing nothing but socks and watching Hulu reality cooking shows, your personal time is YOUR PERSONAL TIME.\n\nObviously, if you have to go into a lab and clean animal cages or something on a schedule, that's a different story. You should probably follow through with whatever you've committed to.\n\nBut I'm talking about the people who have these overbearing advisors who ask them to do extra work or respond to messages over the weekend. Like bro, you're camping out in the woods. No signal. It's sleep-o-clock.\n\nIt is 100% okay to ignore them. If they don't like it, then they need to learn some management lessons. That's THEIR problem, not yours.\n\nIDK, sounds like some of you need to hear it.\n\nEdit: Thanks for the awards! :D\n\nAlso edit: I'm so glad to hear that so many of you value your personal boundaries. I think that's amazing. Keep on truckin'",
    "is_self": true,
    "link_flair_text": "Interpersonal Issues",
    "comments": [
      {
        "comment_id": "jh98h7x",
        "author": "marsbartender",
        "body": "Ignoring work emails and messages on non work days is one of the small joys in life.",
        "score": 197,
        "created_utc": 1682160599.0,
        "created_datetime": "2023-04-22T12:49:59",
        "parent_id": "t3_12v0p41",
        "is_submitter": false
      },
      {
        "comment_id": "jh9hetu",
        "author": "WoofNBoof",
        "body": "As a grad student about to wrap up my degree who has made friends with a few professors along the way: PLEASE set boundaries for yourself. The lack of work/life balance in academia is already rough enough. You are a scholar, but you are a human first and foremost. Academia will try to snatch every moment possible from you if you let it. But to be the best scholar you can be, you need to take time for yourself and recharge your batteries. Trust me, your students can tell when you're burnt out or exhausted. Most shit can wait. I have had some overly zealous professors who I specifically tell that I will happily wait for a response until their working hours.\n\nBe kind to yourself.",
        "score": 74,
        "created_utc": 1682166913.0,
        "created_datetime": "2023-04-22T14:35:13",
        "parent_id": "t3_12v0p41",
        "is_submitter": false
      },
      {
        "comment_id": "jh9zo0j",
        "author": "[deleted]",
        "body": "My advisor is French, he never send me anything on weekends because he's also off lol.",
        "score": 32,
        "created_utc": 1682176111.0,
        "created_datetime": "2023-04-22T17:08:31",
        "parent_id": "t3_12v0p41",
        "is_submitter": false
      },
      {
        "comment_id": "jha20tj",
        "author": "woohooali",
        "body": "I like to work a couple hours in the early morning on the weekend (I do make up for this by working a very short day on Wednesday!), and I noticed lots of replying to my emails on the weekend. So, now I schedule send emails for Monday morning and also have a line in my signature that says something like “my working hours might not be yours, reply during yours.”",
        "score": 30,
        "created_utc": 1682177126.0,
        "created_datetime": "2023-04-22T17:25:26",
        "parent_id": "t3_12v0p41",
        "is_submitter": false
      },
      {
        "comment_id": "jh95q4s",
        "author": "peachdreamer123",
        "body": "Agreed! My supervisor once told me something along the lines of 'i won't read this draft until Monday so you might as well work on it over the weekend' and I was like bitch, do you think I work on this shit on the weekends??? You pay me equivalent to 20 hours a week MAX, I'm playing video games and getting drunk on weekends bffr",
        "score": 77,
        "created_utc": 1682158186.0,
        "created_datetime": "2023-04-22T12:09:46",
        "parent_id": "t3_12v0p41",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": true,\n  \"reason\": \"The post and comments discuss work-life balance for graduate students and postdocs, a significant concern for international students and researchers, especia",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "1nbuorq",
    "title": "TT R1 Professors, is the job all it's cracked up to be?",
    "author": "Zestyclose_Hawk9014",
    "score": 56,
    "upvote_ratio": 0.9,
    "num_comments": 48,
    "created_utc": 1757353862.0,
    "created_datetime": "2025-09-08T19:51:02",
    "url": "https://www.reddit.com/r/AskAcademia/comments/1nbuorq/tt_r1_professors_is_the_job_all_its_cracked_up_to/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/1nbuorq/tt_r1_professors_is_the_job_all_its_cracked_up_to/",
    "selftext": "Title says it all. For many of us grad students and postdocs, TT professorship is seen as the \"dream job\" where we can finally do the research we want to do in a stable career, but it feels like we never get a complete picture of how it is on the other side.\n\nHow has being a TT professor been in your experience? Do you enjoy the day-to-day as much as you thought you would? Do you miss doing direct lab work? Do you find yourself still being as involved as you want to be, or is most of your time sucked up by meetings, emails and grant writing? Have you experienced anything you didnt expect beforehand? Going back, would you still choose the same path? ",
    "is_self": true,
    "link_flair_text": "STEM",
    "comments": [
      {
        "comment_id": "nd4il2h",
        "author": "ZookeepergameParty47",
        "body": "I’ll just add that not all R1s are the same - there’s a lot of variation. The department/institutional culture matters greatly, and so does your relationships with colleagues.",
        "score": 79,
        "created_utc": 1757354981.0,
        "created_datetime": "2025-09-08T20:09:41",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      },
      {
        "comment_id": "nd4g3tk",
        "author": "Puma_202020",
        "body": "It's a great job, no doubt about it.",
        "score": 36,
        "created_utc": 1757354259.0,
        "created_datetime": "2025-09-08T19:57:39",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      },
      {
        "comment_id": "nd4jzms",
        "author": "Bear-bean",
        "body": "I feel like it has its pros and cons like any job. I’m personally someone who really loves the research but am not in love with teaching. So, in terms of the day to day, I was having more fun as a postdoc spending 8 hours a day on my research and attending seminars (although I won’t complain about the pay bump). I am really grateful for the position though - flexibility to work from anywhere in the summers, few people to answer to as long as you’re doing things and showing face a bit - pretty lovely",
        "score": 24,
        "created_utc": 1757355395.0,
        "created_datetime": "2025-09-08T20:16:35",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      },
      {
        "comment_id": "nd4mvru",
        "author": "esker",
        "body": "Senior faculty / admin here... My day-to-day is almost all meetings and emails, but I get to work on the weekends, so that's a plus! :-) Seriously, it's been a good career where I've had the chance to give back to multiple communities over the years. It's a lot of work, but you really feel like you're making a difference.",
        "score": 17,
        "created_utc": 1757356253.0,
        "created_datetime": "2025-09-08T20:30:53",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      },
      {
        "comment_id": "nd4mva3",
        "author": "ProfPathCambridge",
        "body": "Tenure is stable. TT contracts are fixed term, and a lot of work.",
        "score": 15,
        "created_utc": 1757356249.0,
        "created_datetime": "2025-09-08T20:30:49",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post and comments discuss the experiences of tenure-track (TT) professors at R1 universities.  While this might indirectly relate to the professi",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "1nbuorq",
    "title": "TT R1 Professors, is the job all it's cracked up to be?",
    "author": "Zestyclose_Hawk9014",
    "score": 55,
    "upvote_ratio": 0.91,
    "num_comments": 48,
    "created_utc": 1757353862.0,
    "created_datetime": "2025-09-08T19:51:02",
    "url": "https://www.reddit.com/r/AskAcademia/comments/1nbuorq/tt_r1_professors_is_the_job_all_its_cracked_up_to/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/1nbuorq/tt_r1_professors_is_the_job_all_its_cracked_up_to/",
    "selftext": "Title says it all. For many of us grad students and postdocs, TT professorship is seen as the \"dream job\" where we can finally do the research we want to do in a stable career, but it feels like we never get a complete picture of how it is on the other side.\n\nHow has being a TT professor been in your experience? Do you enjoy the day-to-day as much as you thought you would? Do you miss doing direct lab work? Do you find yourself still being as involved as you want to be, or is most of your time sucked up by meetings, emails and grant writing? Have you experienced anything you didnt expect beforehand? Going back, would you still choose the same path? ",
    "is_self": true,
    "link_flair_text": "STEM",
    "comments": [
      {
        "comment_id": "nd4il2h",
        "author": "ZookeepergameParty47",
        "body": "I’ll just add that not all R1s are the same - there’s a lot of variation. The department/institutional culture matters greatly, and so does your relationships with colleagues.",
        "score": 77,
        "created_utc": 1757354981.0,
        "created_datetime": "2025-09-08T20:09:41",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      },
      {
        "comment_id": "nd4g3tk",
        "author": "Puma_202020",
        "body": "It's a great job, no doubt about it.",
        "score": 35,
        "created_utc": 1757354259.0,
        "created_datetime": "2025-09-08T19:57:39",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      },
      {
        "comment_id": "nd4jzms",
        "author": "Bear-bean",
        "body": "I feel like it has its pros and cons like any job. I’m personally someone who really loves the research but am not in love with teaching. So, in terms of the day to day, I was having more fun as a postdoc spending 8 hours a day on my research and attending seminars (although I won’t complain about the pay bump). I am really grateful for the position though - flexibility to work from anywhere in the summers, few people to answer to as long as you’re doing things and showing face a bit - pretty lovely",
        "score": 23,
        "created_utc": 1757355395.0,
        "created_datetime": "2025-09-08T20:16:35",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      },
      {
        "comment_id": "nd4mvru",
        "author": "esker",
        "body": "Senior faculty / admin here... My day-to-day is almost all meetings and emails, but I get to work on the weekends, so that's a plus! :-) Seriously, it's been a good career where I've had the chance to give back to multiple communities over the years. It's a lot of work, but you really feel like you're making a difference.",
        "score": 16,
        "created_utc": 1757356253.0,
        "created_datetime": "2025-09-08T20:30:53",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      },
      {
        "comment_id": "nd4mva3",
        "author": "ProfPathCambridge",
        "body": "Tenure is stable. TT contracts are fixed term, and a lot of work.",
        "score": 16,
        "created_utc": 1757356249.0,
        "created_datetime": "2025-09-08T20:30:49",
        "parent_id": "t3_1nbuorq",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post and comments discuss the experiences of tenure-track (TT) professors in R1 universities. While this might indirectly relate to the professio",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "1nbeovc",
    "title": "Has anyone actually been to a predatory conference?",
    "author": "CaptainCrash86",
    "score": 157,
    "upvote_ratio": 0.99,
    "num_comments": 32,
    "created_utc": 1757306983.0,
    "created_datetime": "2025-09-08T06:49:43",
    "url": "https://www.reddit.com/r/AskAcademia/comments/1nbeovc/has_anyone_actually_been_to_a_predatory_conference/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/1nbeovc/has_anyone_actually_been_to_a_predatory_conference/",
    "selftext": "Like most academics, I get invites to predatory conference daily. I was wondering if anyone has actually been to one? Are they outright scams, like Fyre Festival for academics, or do they actually happen? ",
    "is_self": true,
    "link_flair_text": "STEM",
    "comments": [
      {
        "comment_id": "nd245b5",
        "author": "egetmzkn",
        "body": "I have a friend who *willingly* participated in one with a colleague. Their university introduced a yearly conference attendance criterion out of nowhere, and they were given until the end of the year (six to seven months) to meet the criterion, or risk having their contract not be renewed. \n\nMy friend had the idea of attending a predatory conference, because all proper congresses close abstract submission almost a year before the conference. \n\nThey were able to submit two abstracts (one for each of them) and get an \"instant acceptance\" as a long-form oral presentation 3 weeks before the conference. It was originally announced that the conference would be held in a smaller city in our country, at the city's one and only conference centre. However, 1 week before the conference, they emailed all speakers (presumably), saying that due to logistical issues, they had to move the conference online.\n\nAfter that, they received another email which basically said something like: \"When it is your time to present, join the online meeting via the link, and when your presentation is over, just leave the meeting. Your certificate of attendance, as well as certificates for your presentations, will be sent to you within an hour.\"\n\nAnd that exact thing actually, really happened. Their presentations were back-to-back from 11.30 to 11.50. They both joined at 11.20, and left as soon as their presentations were over. There were around 20 other people in the meeting with their webcams on, but no one asked a question. All of their certificates were sent by email in around 15 minutes.\n\nThey both were able to use the certificates for the criterion because, on paper, every single thing about the conference was legit.",
        "score": 199,
        "created_utc": 1757325207.0,
        "created_datetime": "2025-09-08T11:53:27",
        "parent_id": "t3_1nbeovc",
        "is_submitter": false
      },
      {
        "comment_id": "nd1bqa0",
        "author": "ImeldasManolos",
        "body": "Omg my friend did this. He flew from\n[REDACTED] (overseas) to Brisbane to listen to talks about basically every single topic, from immunology to agriculture, then they all had posters and then they lined up and all got a prize for their talk and or poster.\n\nPretty shady!",
        "score": 211,
        "created_utc": 1757308523.0,
        "created_datetime": "2025-09-08T07:15:23",
        "parent_id": "t3_1nbeovc",
        "is_submitter": false
      },
      {
        "comment_id": "nd2bldw",
        "author": "Enough-Lab9402",
        "body": "It’s decided. Who’s putting together the Reddit Uber Science conference?",
        "score": 76,
        "created_utc": 1757329232.0,
        "created_datetime": "2025-09-08T13:00:32",
        "parent_id": "t3_1nbeovc",
        "is_submitter": false
      },
      {
        "comment_id": "nd2bdsm",
        "author": "Enough-Lab9402",
        "body": "I love this thread.\n\nThe adult in me worries about the obvious scam and waste of usually taxpayer money.\n\nActual me is just rolling over from this hilarity.",
        "score": 33,
        "created_utc": 1757329129.0,
        "created_datetime": "2025-09-08T12:58:49",
        "parent_id": "t3_1nbeovc",
        "is_submitter": false
      },
      {
        "comment_id": "nd1g7pd",
        "author": "cat-head",
        "body": " There are people who show up for those?! From the way the emails look,  I thought it was a way for shitty academics to get their vacation in Greece refunded by the university without having to do any science.",
        "score": 70,
        "created_utc": 1757310899.0,
        "created_datetime": "2025-09-08T07:54:59",
        "parent_id": "t3_1nbeovc",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post and comments discuss predatory academic conferences, a topic unrelated to immigration to Germany, studying abroad in Germany, or German admi",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  },
  {
    "subreddit": "AskAcademia",
    "post_id": "1nb133q",
    "title": "Single author paper from undergrad. Disown or embrace?",
    "author": "RectalAbscess212",
    "score": 75,
    "upvote_ratio": 0.83,
    "num_comments": 52,
    "created_utc": 1757270303.0,
    "created_datetime": "2025-09-07T20:38:23",
    "url": "https://www.reddit.com/r/AskAcademia/comments/1nb133q/single_author_paper_from_undergrad_disown_or/",
    "permalink": "https://reddit.com/r/AskAcademia/comments/1nb133q/single_author_paper_from_undergrad_disown_or/",
    "selftext": "For my senior thesis in undergrad, I ended up getting outstanding neuroscience student of the year award. It was a decent thesis. It was on sleep patterns in drosophila. However, I wasn't always the best student, and for whatever reason, I didn't have the best relationship with my PI. When I asked him to publish my results, he said he wanted \"neither credit nor blame\" for my results. I ended up publishing them as a single author study in PeerJ (a somewhat lowly journal). I still think the work isn't bad; I stand by it. It's been cited 5 times since 2016, once or twice by papers in good journals which have themselves been cited quite a bit. \n\nI've basically deleted this paper from my resume, because I'm ashamed of it, not as much because of the lowly journal, but because it's single author. Thoughts on what to do with this? Disown it or re-embrace it?\n\nI have since published first-author papers in high-impact journals, with a totally different PI and different work. This is an ancient relic at this point. \n\nFor context, I'm currently writing a K99/R00, and I'm wondering whether to mention this in my \"Candidate background\" section.",
    "is_self": true,
    "link_flair_text": "STEM",
    "comments": [
      {
        "comment_id": "ncy95p6",
        "author": "ethnographyNW",
        "body": "I'm in a social science field where single author publications are the norm. I understand that's not the case in other fields, obviously, but I'm rather surprised to hear that it's something that people feel embarrassed about. What exactly is shameful about it?",
        "score": 155,
        "created_utc": 1757270873.0,
        "created_datetime": "2025-09-07T20:47:53",
        "parent_id": "t3_1nb133q",
        "is_submitter": false
      },
      {
        "comment_id": "ncycu30",
        "author": "Ringbailwanton",
        "body": "Leave it in. Papers published during undergrad aren’t expected to be in Cell or Science. It shows you’ve been through the process of submission and review, and it’s been cited. I’d keep it.",
        "score": 78,
        "created_utc": 1757271898.0,
        "created_datetime": "2025-09-07T21:04:58",
        "parent_id": "t3_1nb133q",
        "is_submitter": false
      },
      {
        "comment_id": "ncyjf6t",
        "author": "DocAvidd",
        "body": "PeerJ isnt like a publish-anything journal and is indexed. Anyone who searches on the first author will find it. And even if it's not your best work, should feel proud. All of us did better work as we advanced, and aren't going to judge an undergrad pub negatively.",
        "score": 34,
        "created_utc": 1757273742.0,
        "created_datetime": "2025-09-07T21:35:42",
        "parent_id": "t3_1nb133q",
        "is_submitter": false
      },
      {
        "comment_id": "ncygn76",
        "author": "juuussi",
        "body": "I work in biomedical field. Single author paper, especially early n your career is suoer valuable, much more so than crowded multi-author paper. Would have a big positive impact on your resume.",
        "score": 25,
        "created_utc": 1757272972.0,
        "created_datetime": "2025-09-07T21:22:52",
        "parent_id": "t3_1nb133q",
        "is_submitter": false
      },
      {
        "comment_id": "ncy909o",
        "author": "Puma_202020",
        "body": "Embrace it.  A single author paper is fine in my field (ecology).  The lower tier journal is not as helpful, true, but starting out, it is great.  Plus, dropping conferences or the like from a CV makes sense if you wish, to me, but I would keep my publishing history intact.  It's work you did and part of your experience.",
        "score": 35,
        "created_utc": 1757270830.0,
        "created_datetime": "2025-09-07T20:47:10",
        "parent_id": "t3_1nb133q",
        "is_submitter": false
      }
    ],
    "relevance_analysis": {
      "relevant": true,
      "reason": "```json\n{\n  \"relevant\": false,\n  \"reason\": \"The Reddit post and comments discuss the challenges of publishing undergraduate research and the decision of whether to include it on a CV.  This is related",
      "confidence": 0.7,
      "topics": [],
      "usefulness": "medium"
    },
    "subreddit_priority": 1
  }
]